snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
typedef struct stc_mfs_csio_scscr_field
{
  __IO uint16_t CSOE       : 1;
  __IO uint16_t CSEN0      : 1;
       uint16_t RESERVED1  : 3;
  __IO uint16_t CSLVL      : 1;
  __IO uint16_t CDIV       : 3;
  __IO uint16_t SCAM       : 1;
       uint16_t RESERVED2  : 6;
} stc_mfs_csio_scscr_field_t;

/******************************************************************************
 * MFS_MODULE(I2C)
 ******************************************************************************/
/* MFS_MODULE(I2C) register bit fields */
typedef struct stc_mfs_i2c_ibcr_field
{
  __IO  uint8_t INT        : 1;
  __IO  uint8_t BER        : 1;
  __IO  uint8_t INTE       : 1;
  __IO  uint8_t CNDE       : 1;
  __IO  uint8_t WSEL       : 1;
  __IO  uint8_t ACKE       : 1;
  __IO  uint8_t ACT_SCC    : 1;
  __IO  uint8_t MSS        : 1;
} stc_mfs_i2c_ibcr_field_t;

typedef struct stc_mfs_i2c_ibsr_field
{
  __IO  uint8_t BB         : 1;
  __IO  uint8_t SPC        : 1;
  __IO  uint8_t RSC        : 1;
  __IO  uint8_t AL         : 1;
  __IO  uint8_t TRX        : 1;
  __IO  uint8_t RSA        : 1;
  __IO  uint8_t RACK       : 1;
  __IO  uint8_t FBT        : 1;
} stc_mfs_i2c_ibsr_field_t;

typedef struct stc_mfs_i2c_isba_field
{
  union {
    struct {
      __IO  uint8_t SA         : 7;
      __IO  uint8_t SAEN       : 1;
    };
    struct {
      __IO  uint8_t SA0        : 1;
      __IO  uint8_t SA1        : 1;
      __IO  uint8_t SA2        : 1;
      __IO  uint8_t SA3        : 1;
      __IO  uint8_t SA4        : 1;
      __IO  uint8_t SA5        : 1;
      __IO  uint8_t SA6        : 1;
            uint8_t RESERVED1  : 1;
    };
  };
} stc_mfs_i2c_isba_field_t;

typedef struct stc_mfs_i2c_ismk_field
{
  union {
    struct {
      __IO  uint8_t SM         : 7;
      __IO  uint8_t EN         : 1;
    };
    struct {
      __IO  uint8_t SM0        : 1;
      __IO  uint8_t SM1        : 1;
      __IO  uint8_t SM2        : 1;
      __IO  uint8_t SM3        : 1;
      __IO  uint8_t SM4        : 1;
      __IO  uint8_t SM5        : 1;
      __IO  uint8_t SM6        : 1;
            uint8_t RESERVED1  : 1;
    };
  };
} stc_mfs_i2c_ismk_field_t;

typedef struct stc_mfs_i2c_nfcr_field
{
  __IO  uint8_t NFT        : 5;
        uint8_t RESERVED1  : 3;
} stc_mfs_i2c_nfcr_field_t;

typedef struct stc_mfs_i2c_eibcr_field
{
  __IO  uint8_t BEC        : 1;
  __IO  uint8_t SOCE       : 1;
  __IO  uint8_t SCLC       : 1;
  __IO  uint8_t SDAC       : 1;
  __IO  uint8_t SCLS       : 1;
  __IO  uint8_t SDAS       : 1;
        uint8_t RESERVED1  : 2;
} stc_mfs_i2c_eibcr_field_t;

/******************************************************************************
 * CRC_MODULE
 ******************************************************************************/
/* CRC_MODULE register bit fields */
typedef struct stc_crc_crccr_field
{
  __IO  uint8_t INIT       : 1;
  __IO  uint8_t CRC32      : 1;
  __IO  uint8_t LTLEND     : 1;
  __IO  uint8_t LSBFST     : 1;
  __IO  uint8_t CRCLTE     : 1;
  __IO  uint8_t CRCLSF     : 1;
  __IO  uint8_t FXOR       : 1;
} stc_crc_crccr_field_t;

/******************************************************************************
 * WC_MODULE
 ******************************************************************************/
/* WC_MODULE register bit fields */
typedef struct stc_wc_wcrd_field
{
  __IO  uint8_t CTR0       : 1;
  __IO  uint8_t CTR1       : 1;
  __IO  uint8_t CTR2       : 1;
  __IO  uint8_t CTR3       : 1;
  __IO  uint8_t CTR4       : 1;
  __IO  uint8_t CTR5       : 1;
} stc_wc_wcrd_field_t;

typedef struct stc_wc_wcrl_field
{
  __IO  uint8_t RLC0       : 1;
  __IO  uint8_t RLC1       : 1;
  __IO  uint8_t RLC2       : 1;
  __IO  uint8_t RLC3       : 1;
  __IO  uint8_t RLC4       : 1;
  __IO  uint8_t RLC5       : 1;
} stc_wc_wcrl_field_t;

typedef struct stc_wc_wccr_field
{
  __IO  uint8_t WCIF       : 1;
  __IO  uint8_t WCIE       : 1;
  __IO  uint8_t CS0        : 1;
  __IO  uint8_t CS1        : 1;
        uint8_t RESERVED1  : 2;
  __IO  uint8_t WCOP       : 1;
  __IO  uint8_t WCEN       : 1;
} stc_wc_wccr_field_t;

typedef struct stc_wc_clk_sel_field
{
  __IO uint16_t SEL_IN     : 2;
       uint16_t RESERVED1  : 6;
  __IO uint16_t SEL_OUT    : 3;
} stc_wc_clk_sel_field_t;

typedef struct stc_wc_clk_en_field
{
  __IO  uint8_t CLK_EN     : 1;
  __IO  uint8_t CLK_EN_R   : 1;
} stc_wc_clk_en_field_t;

/******************************************************************************
 * RTC_MODULE
 ******************************************************************************/
/* RTC_MODULE register bit fields */
/* RTC CNT */
typedef struct stc_rtc_wtcr10_field
{
  __IO  uint8_t ST         : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t RUN        : 1;
  __IO  uint8_t SRST       : 1;
  __IO  uint8_t SCST       : 1;
  __IO  uint8_t SCRST      : 1;
  __IO  uint8_t BUSY       : 1;
  __IO  uint8_t TRANS      : 1;
} stc_rtc_wtcr10_field_t;

typedef struct stc_rtc_wtcr11_field
{
  __IO  uint8_t MIEN       : 1;
  __IO  uint8_t HEN        : 1;
  __IO  uint8_t DEN        : 1;
  __IO  uint8_t MOEN       : 1;
  __IO  uint8_t YEN        : 1;
        uint8_t RESERVED1  : 3;
} stc_rtc_wtcr11_field_t;

typedef struct stc_rtc_wtcr12_field
{
  __IO  uint8_t INTSSI     : 1;
  __IO  uint8_t INTSI      : 1;
  __IO  uint8_t INTMI      : 1;
  __IO  uint8_t INTHI      : 1;
  __IO  uint8_t INTTMI     : 1;
  __IO  uint8_t INTALI     : 1;
  __IO  uint8_t INTERI     : 1;
  __IO  uint8_t INTCRI     : 1;
} stc_rtc_wtcr12_field_t;

typedef struct stc_rtc_wtcr13_field
{
  __IO  uint8_t INTSSIE    : 1;
  __IO  uint8_t INTSIE     : 1;
  __IO  uint8_t INTMIE     : 1;
  __IO  uint8_t INTHIE     : 1;
  __IO  uint8_t INTTMIE    : 1;
  __IO  uint8_t INTALIE    : 1;
  __IO  uint8_t INTERIE    : 1;
  __IO  uint8_t INTCRIE    : 1;
} stc_rtc_wtcr13_field_t;

typedef struct stc_rtc_wtcr20_field
{
  __IO  uint8_t CREAD      : 1;
  __IO  uint8_t CWRITE     : 1;
  __IO  uint8_t BREAD      : 1;
  __IO  uint8_t BWRITE     : 1;
  __IO  uint8_t PREAD      : 1;
  __IO  uint8_t PWRITE     : 1;
        uint8_t RESERVED1  : 2;
} stc_rtc_wtcr20_field_t;

typedef struct stc_rtc_wtcr21_field
{
  __IO  uint8_t TMST       : 1;
  __IO  uint8_t TMEN       : 1;
  __IO  uint8_t TMRUN      : 1;
        uint8_t RESERVED1  : 5;
} stc_rtc_wtcr21_field_t;

typedef struct stc_rtc_wtsr_field
{
  union {
    struct {
      __IO  uint8_t S          : 4;
      __IO  uint8_t TS         : 3;
            uint8_t RESERVED1  : 1;
    };
    struct {
      __IO  uint8_t S0         : 1;
      __IO  uint8_t S1         : 1;
      __IO  uint8_t S2         : 1;
      __IO  uint8_t S3         : 1;
      __IO  uint8_t TS0        : 1;
      __IO  uint8_t TS1        : 1;
      __IO  uint8_t TS2        : 1;
            uint8_t RESERVED2  : 1;
    };
  };
} stc_rtc_wtsr_field_t;

typedef struct stc_rtc_wtmir_field
{
  union {
    struct {
      __IO  uint8_t MI         : 4;
      __IO  uint8_t TMI        : 3;
            uint8_t RESERVED1  : 1;
    };
    struct {
      __IO  uint8_t MI0        : 1;
      __IO  uint8_t MI1        : 1;
      __IO  uint8_t MI2        : 1;
      __IO  uint8_t MI3        : 1;
      __IO  uint8_t TMI0       : 1;
      __IO  uint8_t TMI1       : 1;
      __IO  uint8_t TMI2       : 1;
            uint8_t RESERVED2  : 1;
    };
  };
} stc_rtc_wtmir_field_t;

typedef struct stc_rtc_wthr_field
{
  union {
    struct {
      __IO  uint8_t H          : 4;
      __IO  uint8_t TH         : 2;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t H0         : 1;
      __IO  uint8_t H1         : 1;
      __IO  uint8_t H2         : 1;
      __IO  uint8_t H3         : 1;
      __IO  uint8_t TH0        : 1;
      __IO  uint8_t TH1        : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_wthr_field_t;

