snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
typedef struct stc_sdif_sslist_field
{
  __IO uint16_t SLOTINTSGN: 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_sslist_field_t;

typedef struct stc_sdif_shctlv_field
{
  __IO uint16_t SPECVERNUM: 8;
  __IO uint16_t VNDVERNUM : 8;
} stc_sdif_shctlv_field_t;

typedef struct stc_sdif_ahbcfgl_field
{
  __IO uint16_t INCRSEL   : 3;
  __IO uint16_t SINEN     : 1;
  __IO uint16_t BSLOCK    : 1;
  __IO uint16_t BSLOCKSEL : 1;
  __IO uint16_t ENDIANSEL : 1;
       uint16_t RESERVED1 : 9;
} stc_sdif_ahbcfgl_field_t;

typedef struct stc_sdif_ahbcfgh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_ahbcfgh_field_t;

typedef struct stc_sdif_spwswcl_field
{
  __IO uint16_t ATPWRSWEN : 1;
  __IO uint16_t IOREGSEL  : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_spwswcl_field_t;

typedef struct stc_sdif_spwswch_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_spwswch_field_t;

typedef struct stc_sdif_stunsetl_field
{
  __IO uint16_t TNPTSEL   : 8;
  __IO uint16_t TNPHSELEN : 1;
  __IO uint16_t TNERRBDSEL: 1;
  __IO uint16_t RETNTAPSEL: 1;
  __IO uint16_t RETNRNGSEL: 2;
       uint16_t RESERVED1 : 3;
} stc_sdif_stunsetl_field_t;

typedef struct stc_sdif_stunseth_field
{
  __IO uint16_t CMDCFCHKDS: 1;
       uint16_t RESERVED1 : 7;
  __IO uint16_t DTOTCNTVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_stunseth_field_t;

typedef struct stc_sdif_stunstl_field
{
  __IO uint16_t REP8TNRSLT: 8;
  __IO uint16_t REP3TNRSLT: 3;
       uint16_t RESERVED1 : 5;
} stc_sdif_stunstl_field_t;

typedef struct stc_sdif_stunsth_field
{
  __IO uint16_t PRSTTNPNT : 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_stunsth_field_t;

typedef struct stc_sdif_pswistl_field
{
  __IO uint16_t INT5MS    : 1;
  __IO uint16_t INT1MS    : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistl_field_t;

typedef struct stc_sdif_pswisth_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisth_field_t;


typedef struct stc_sdif_pswistel_field
{
  __IO uint16_t INT5MSSTS : 1;
  __IO uint16_t INT1MSSTS : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistel_field_t;

typedef struct stc_sdif_pswisteh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisteh_field_t;

typedef struct stc_sdif_pswisgel_field
{
  __IO uint16_t INT5MSSGEN: 1;
  __IO uint16_t INT1MSSGEN: 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswisgel_field_t;

typedef struct stc_sdif_pswisgeh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisgeh_field_t;

typedef struct stc_sdif_mmcsdcl_field
{
  __IO uint16_t LCKRSTESD : 1;
  __IO uint16_t RSTMMC    : 1;
  __IO uint16_t VCCCTLMMC : 1;
  __IO uint16_t VCCQCTLMMC: 1;
       uint16_t RESERVED1 : 4;
  __IO uint16_t MMCDDRSEL : 1;
  __IO uint16_t CMDDATDLY : 1;
       uint16_t RESERVED2 : 6;
} stc_sdif_mmcsdcl_field_t;

typedef struct stc_sdif_mmcsdch_field
{
  __IO uint16_t BTACKENMMC: 1;
  __IO uint16_t BTABTENMMC: 1;
  __IO uint16_t BTMDENMMC : 1;
       uint16_t RESERVED1 : 13;
} stc_sdif_mmcsdch_field_t;

typedef struct stc_sdif_mcwirqc0_field
{
  __IO uint16_t WTIRQEN   : 1;
  __IO uint16_t WTIRQST   : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_mcwirqc0_field_t;

typedef struct stc_sdif_mcwirqc1_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc1_field_t;

typedef struct stc_sdif_mcwirqc2_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc2_field_t;

typedef struct stc_sdif_mcwirqc3_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc3_field_t;

typedef struct stc_sdif_mcrpckbl_field
{
  __IO uint16_t CHECKBIT1 : 7;
  __IO uint16_t CHECKBIT2 : 6;
       uint16_t RESERVED1 : 3;
} stc_sdif_mcrpckbl_field_t;

typedef struct stc_sdif_mcrpckbh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_mcrpckbh_field_t;

typedef struct stc_sdif_scdetecs_field
{
       uint16_t RESERVED1 : 8;
  __IO uint16_t CDDEBTCVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_scdetecs_field_t;

/******************************************************************************
 * Peripheral register structures
 ******************************************************************************/

/******************************************************************************
 * WorkFlash_IF_MODULE
 ******************************************************************************/
/* WorkFlash interface registers */
typedef struct
{
  union {
    __IO uint32_t WFASZR;
    stc_workflash_if_wfaszr_field_t WFASZR_f;
  };
  union {
    __IO uint32_t WFRWTR;
    stc_workflash_if_wfrwtr_field_t WFRWTR_f;
  };
  union {
    __IO uint32_t WFSTR;
    stc_workflash_if_wfstr_field_t WFSTR_f;
  };
}FM4_WORKFLASH_IF_TypeDef;

/******************************************************************************
 * Flash_IF_MODULE
 ******************************************************************************/
/* Flash interface registers */
typedef struct
{
  union {
    __IO uint32_t FASZR;
    stc_flash_if_faszr_field_t FASZR_f;
  };
  union {
    __IO uint32_t FRWTR;
    stc_flash_if_frwtr_field_t FRWTR_f;
  };
  union {
    __IO uint32_t FSTR;
    stc_flash_if_fstr_field_t FSTR_f;
  };
       uint8_t RESERVED2[4];
  union {
    __IO uint32_t FSYNDN;
    stc_flash_if_fsyndn_field_t FSYNDN_f;
  };
  union {
    __IO uint32_t FBFCR;
    stc_flash_if_fbfcr_field_t FBFCR_f;
  };
       uint8_t RESERVED4[8];
  union {
    __IO uint32_t FICR;
    stc_flash_if_ficr_field_t FICR_f;
  };
  union {
    __IO uint32_t FISR;
    stc_flash_if_fisr_field_t FISR_f;
  };
  union {
    __IO uint32_t FICLR;
    stc_flash_if_ficlr_field_t FICLR_f;
  };
       uint8_t RESERVED7[212];
  union {
    __IO uint32_t CRTRMM;
    stc_flash_if_crtrmm_field_t CRTRMM_f;
  };
}FM4_FLASH_IF_TypeDef;

/******************************************************************************
 * UNIQUE_ID_MODULE
 ******************************************************************************/
/* Unique ID registers */
typedef struct
{
  union {
    __IO uint32_t UIDR0;
    stc_unique_id_uidr0_field_t UIDR0_f;
  };
  union {
    __IO uint32_t UIDR1;
    stc_unique_id_uidr1_field_t UIDR1_f;
  };
}FM4_UNIQUE_ID_TypeDef;

