snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
#define FM4_EXTI        ((FM4_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM4_INTREQ      ((FM4_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM4_IRQSEL      ((FM4_IRQSEL_TypeDef *)FM4_IRQSEL_BASE)
#define FM4_GPIO        ((FM4_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM4_LVD         ((FM4_LVD_TypeDef *)FM4_LVD_BASE)
#define FM4_DS          ((FM4_DS_TypeDef *)FM4_DS_BASE)
#define FM4_USBCLK      ((FM4_USBCLK_TypeDef *)FM4_USBCLK_BASE)
#define FM4_CANPRES     ((FM4_CANPRE_TypeDef *)FM4_CANPRES_BASE)
#define FM4_MFS0        ((FM4_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS1        ((FM4_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS2        ((FM4_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS3        ((FM4_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS4        ((FM4_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS5        ((FM4_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS6        ((FM4_MFS_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS7        ((FM4_MFS_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS8        ((FM4_MFS_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS9        ((FM4_MFS_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS10       ((FM4_MFS_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS11       ((FM4_MFS_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS12       ((FM4_MFS_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS13       ((FM4_MFS_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS14       ((FM4_MFS_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS15       ((FM4_MFS_TypeDef *)FM4_MFS15_BASE)
#define FM4_CRC         ((FM4_CRC_TypeDef *)FM4_CRC_BASE)
#define FM4_WC          ((FM4_WC_TypeDef *)FM4_WC_BASE)
#define FM4_RTC         ((FM4_RTC_TypeDef *)FM4_RTC_BASE)
#define FM4_LCR         ((FM4_LCR_TypeDef *)FM4_LCR_BASE)
#define FM4_CLK_GATING  ((FM4_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM4_PLL_CONTROL ((FM4_PLL_CONTROL_TypeDef *)FM4_PLL_CONTROL_BASE)
#define FM4_EXBUS       ((FM4_EXBUS_TypeDef *)FM4_EXBUS_BASE)
#define FM4_USB0        ((FM4_USB_TypeDef *)FM4_USB0_BASE)
#define FM4_USB1        ((FM4_USB_TypeDef *)FM4_USB1_BASE)
#define FM4_DMAC        ((FM4_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM4_DSTC        ((FM4_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM4_CAN0        ((FM4_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM4_CAN1        ((FM4_CAN_TypeDef *)FM4_CAN1_BASE)
#define FM4_SDIF        ((FM4_SDIF_TypeDef *)FM4_SDIF_BASE)
/******************************************************************************
 * Peripheral Bit Band Alias declaration
 ******************************************************************************/

/* Work Flash interface registers */
#define bFM4_WORKFLASH_IF_WFASZR_ASZ           *((volatile unsigned int*)(0x23C00000UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT0          *((volatile unsigned int*)(0x23C00080UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT1          *((volatile unsigned int*)(0x23C00084UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT2          *((volatile unsigned int*)(0x23C00088UL))
#define bFM4_WORKFLASH_IF_WFSTR_RDY            *((volatile unsigned int*)(0x23C00100UL))
#define bFM4_WORKFLASH_IF_WFSTR_HNG            *((volatile unsigned int*)(0x23C00104UL))

/* Flash interface registers */
#define bFM4_FLASH_IF_FASZR_ASZ0               *((volatile unsigned int*)(0x42000000UL))
#define bFM4_FLASH_IF_FASZR_ASZ1               *((volatile unsigned int*)(0x42000004UL))
#define bFM4_FLASH_IF_FRWTR_RWT0               *((volatile unsigned int*)(0x42000080UL))
#define bFM4_FLASH_IF_FRWTR_RWT1               *((volatile unsigned int*)(0x42000084UL))
#define bFM4_FLASH_IF_FSTR_RDY                 *((volatile unsigned int*)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_HNG                 *((volatile unsigned int*)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_ERR                 *((volatile unsigned int*)(0x42000108UL))
#define bFM4_FLASH_IF_FSYNDN_SD0               *((volatile unsigned int*)(0x42000200UL))
#define bFM4_FLASH_IF_FSYNDN_SD1               *((volatile unsigned int*)(0x42000204UL))
#define bFM4_FLASH_IF_FSYNDN_SD2               *((volatile unsigned int*)(0x42000208UL))
#define bFM4_FLASH_IF_FBFCR_BE                 *((volatile unsigned int*)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BS                 *((volatile unsigned int*)(0x42000284UL))
#define bFM4_FLASH_IF_FICR_RDYIE               *((volatile unsigned int*)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_HANGIE              *((volatile unsigned int*)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_ERRIE               *((volatile unsigned int*)(0x42000408UL))
#define bFM4_FLASH_IF_FISR_RDYIF               *((volatile unsigned int*)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_HANGIF              *((volatile unsigned int*)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_ERRIF               *((volatile unsigned int*)(0x42000488UL))
#define bFM4_FLASH_IF_FICLR_RDYIC              *((volatile unsigned int*)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_HANGIC             *((volatile unsigned int*)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_ERRIC              *((volatile unsigned int*)(0x42000508UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM0             *((volatile unsigned int*)(0x42002000UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM1             *((volatile unsigned int*)(0x42002004UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM2             *((volatile unsigned int*)(0x42002008UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM3             *((volatile unsigned int*)(0x4200200CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM4             *((volatile unsigned int*)(0x42002010UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM5             *((volatile unsigned int*)(0x42002014UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM6             *((volatile unsigned int*)(0x42002018UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM7             *((volatile unsigned int*)(0x4200201CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM8             *((volatile unsigned int*)(0x42002020UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM9             *((volatile unsigned int*)(0x42002024UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM0            *((volatile unsigned int*)(0x42002040UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM1            *((volatile unsigned int*)(0x42002044UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM2            *((volatile unsigned int*)(0x42002048UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM3            *((volatile unsigned int*)(0x4200204CUL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM4            *((volatile unsigned int*)(0x42002050UL))

/* Unique ID registers */
#define bFM4_UNIQUE_ID_UIDR0_UID0              *((volatile unsigned int*)(0x42004010UL))
#define bFM4_UNIQUE_ID_UIDR0_UID1              *((volatile unsigned int*)(0x42004014UL))
#define bFM4_UNIQUE_ID_UIDR0_UID2              *((volatile unsigned int*)(0x42004018UL))
#define bFM4_UNIQUE_ID_UIDR0_UID3              *((volatile unsigned int*)(0x4200401CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID4              *((volatile unsigned int*)(0x42004020UL))
#define bFM4_UNIQUE_ID_UIDR0_UID5              *((volatile unsigned int*)(0x42004024UL))
#define bFM4_UNIQUE_ID_UIDR0_UID6              *((volatile unsigned int*)(0x42004028UL))
#define bFM4_UNIQUE_ID_UIDR0_UID7              *((volatile unsigned int*)(0x4200402CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID8              *((volatile unsigned int*)(0x42004030UL))
#define bFM4_UNIQUE_ID_UIDR0_UID9              *((volatile unsigned int*)(0x42004034UL))
#define bFM4_UNIQUE_ID_UIDR0_UID10             *((volatile unsigned int*)(0x42004038UL))
#define bFM4_UNIQUE_ID_UIDR0_UID11             *((volatile unsigned int*)(0x4200403CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID12             *((volatile unsigned int*)(0x42004040UL))
#define bFM4_UNIQUE_ID_UIDR0_UID13             *((volatile unsigned int*)(0x42004044UL))
#define bFM4_UNIQUE_ID_UIDR0_UID14             *((volatile unsigned int*)(0x42004048UL))
#define bFM4_UNIQUE_ID_UIDR0_UID15             *((volatile unsigned int*)(0x4200404CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID16             *((volatile unsigned int*)(0x42004050UL))
#define bFM4_UNIQUE_ID_UIDR0_UID17             *((volatile unsigned int*)(0x42004054UL))
#define bFM4_UNIQUE_ID_UIDR0_UID18             *((volatile unsigned int*)(0x42004058UL))
#define bFM4_UNIQUE_ID_UIDR0_UID19             *((volatile unsigned int*)(0x4200405CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID20             *((volatile unsigned int*)(0x42004060UL))
#define bFM4_UNIQUE_ID_UIDR0_UID21             *((volatile unsigned int*)(0x42004064UL))
#define bFM4_UNIQUE_ID_UIDR0_UID22             *((volatile unsigned int*)(0x42004068UL))
#define bFM4_UNIQUE_ID_UIDR0_UID23             *((volatile unsigned int*)(0x4200406CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID24             *((volatile unsigned int*)(0x42004070UL))
#define bFM4_UNIQUE_ID_UIDR0_UID25             *((volatile unsigned int*)(0x42004074UL))
#define bFM4_UNIQUE_ID_UIDR0_UID26             *((volatile unsigned int*)(0x42004078UL))
#define bFM4_UNIQUE_ID_UIDR0_UID27             *((volatile unsigned int*)(0x4200407CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID28             *((volatile unsigned int*)(0x42004080UL))
#define bFM4_UNIQUE_ID_UIDR1_UID29             *((volatile unsigned int*)(0x42004084UL))
#define bFM4_UNIQUE_ID_UIDR1_UID30             *((volatile unsigned int*)(0x42004088UL))
#define bFM4_UNIQUE_ID_UIDR1_UID31             *((volatile unsigned int*)(0x4200408CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID32             *((volatile unsigned int*)(0x42004090UL))
#define bFM4_UNIQUE_ID_UIDR1_UID33             *((volatile unsigned int*)(0x42004094UL))
#define bFM4_UNIQUE_ID_UIDR1_UID34             *((volatile unsigned int*)(0x42004098UL))
#define bFM4_UNIQUE_ID_UIDR1_UID35             *((volatile unsigned int*)(0x4200409CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID36             *((volatile unsigned int*)(0x420040A0UL))
#define bFM4_UNIQUE_ID_UIDR1_UID37             *((volatile unsigned int*)(0x420040A4UL))
#define bFM4_UNIQUE_ID_UIDR1_UID38             *((volatile unsigned int*)(0x420040A8UL))
#define bFM4_UNIQUE_ID_UIDR1_UID39             *((volatile unsigned int*)(0x420040ACUL))
#define bFM4_UNIQUE_ID_UIDR1_UID40             *((volatile unsigned int*)(0x420040B0UL))

