snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* Dual timer 1/2 registers */
#define bFM4_DTIM_TIMER1CONTROL_ONESHOT        *((volatile unsigned int*)(0x422A0100UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERSIZE      *((volatile unsigned int*)(0x422A0104UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERPRE0      *((volatile unsigned int*)(0x422A0108UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERPRE1      *((volatile unsigned int*)(0x422A010CUL))
#define bFM4_DTIM_TIMER1CONTROL_INTENABLE      *((volatile unsigned int*)(0x422A0114UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERMODE      *((volatile unsigned int*)(0x422A0118UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMEREN        *((volatile unsigned int*)(0x422A011CUL))
#define bFM4_DTIM_TIMER1RIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0200UL))
#define bFM4_DTIM_TIMER1MIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0280UL))
#define bFM4_DTIM_TIMER2CONTROL_ONESHOT        *((volatile unsigned int*)(0x422A0500UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERSIZE      *((volatile unsigned int*)(0x422A0504UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERPRE0      *((volatile unsigned int*)(0x422A0508UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERPRE1      *((volatile unsigned int*)(0x422A050CUL))
#define bFM4_DTIM_TIMER2CONTROL_INTENABLE      *((volatile unsigned int*)(0x422A0514UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERMODE      *((volatile unsigned int*)(0x422A0518UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMEREN        *((volatile unsigned int*)(0x422A051CUL))
#define bFM4_DTIM_TIMER2RIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0600UL))
#define bFM4_DTIM_TIMER2MIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0680UL))

/* Multifunction Timer unit 0 Free Running Timer registers */
#define bFM4_MFT0_FRT_TCSA0_CLK0               *((volatile unsigned int*)(0x42402900UL))
#define bFM4_MFT0_FRT_TCSA0_CLK1               *((volatile unsigned int*)(0x42402904UL))
#define bFM4_MFT0_FRT_TCSA0_CLK2               *((volatile unsigned int*)(0x42402908UL))
#define bFM4_MFT0_FRT_TCSA0_CLK3               *((volatile unsigned int*)(0x4240290cUL))
#define bFM4_MFT0_FRT_TCSA0_SCLR               *((volatile unsigned int*)(0x42402910UL))
#define bFM4_MFT0_FRT_TCSA0_MODE               *((volatile unsigned int*)(0x42402914UL))
#define bFM4_MFT0_FRT_TCSA0_STOP               *((volatile unsigned int*)(0x42402918UL))
#define bFM4_MFT0_FRT_TCSA0_BFE                *((volatile unsigned int*)(0x4240291cUL))
#define bFM4_MFT0_FRT_TCSA0_ICRE               *((volatile unsigned int*)(0x42402920UL))
#define bFM4_MFT0_FRT_TCSA0_ICLR               *((volatile unsigned int*)(0x42402924UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZE              *((volatile unsigned int*)(0x42402934UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZF              *((volatile unsigned int*)(0x42402938UL))
#define bFM4_MFT0_FRT_TCSA0_ECKE               *((volatile unsigned int*)(0x4240293cUL))
#define bFM4_MFT0_FRT_TCSA1_CLK0               *((volatile unsigned int*)(0x42402a80UL))
#define bFM4_MFT0_FRT_TCSA1_CLK1               *((volatile unsigned int*)(0x42402a84UL))
#define bFM4_MFT0_FRT_TCSA1_CLK2               *((volatile unsigned int*)(0x42402a88UL))
#define bFM4_MFT0_FRT_TCSA1_CLK3               *((volatile unsigned int*)(0x42402a8cUL))
#define bFM4_MFT0_FRT_TCSA1_SCLR               *((volatile unsigned int*)(0x42402a90UL))
#define bFM4_MFT0_FRT_TCSA1_MODE               *((volatile unsigned int*)(0x42402a94UL))
#define bFM4_MFT0_FRT_TCSA1_STOP               *((volatile unsigned int*)(0x42402a98UL))
#define bFM4_MFT0_FRT_TCSA1_BFE                *((volatile unsigned int*)(0x42402a9cUL))
#define bFM4_MFT0_FRT_TCSA1_ICRE               *((volatile unsigned int*)(0x42402aa0UL))
#define bFM4_MFT0_FRT_TCSA1_ICLR               *((volatile unsigned int*)(0x42402aa4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZE              *((volatile unsigned int*)(0x42402ab4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZF              *((volatile unsigned int*)(0x42402ab8UL))
#define bFM4_MFT0_FRT_TCSA1_ECKE               *((volatile unsigned int*)(0x42402abcUL))
#define bFM4_MFT0_FRT_TCSA2_CLK0               *((volatile unsigned int*)(0x42402c00UL))
#define bFM4_MFT0_FRT_TCSA2_CLK1               *((volatile unsigned int*)(0x42402c04UL))
#define bFM4_MFT0_FRT_TCSA2_CLK2               *((volatile unsigned int*)(0x42402c08UL))
#define bFM4_MFT0_FRT_TCSA2_CLK3               *((volatile unsigned int*)(0x42402c0cUL))
#define bFM4_MFT0_FRT_TCSA2_SCLR               *((volatile unsigned int*)(0x42402c10UL))
#define bFM4_MFT0_FRT_TCSA2_MODE               *((volatile unsigned int*)(0x42402c14UL))
#define bFM4_MFT0_FRT_TCSA2_STOP               *((volatile unsigned int*)(0x42402c18UL))
#define bFM4_MFT0_FRT_TCSA2_BFE                *((volatile unsigned int*)(0x42402c1cUL))
#define bFM4_MFT0_FRT_TCSA2_ICRE               *((volatile unsigned int*)(0x42402c20UL))
#define bFM4_MFT0_FRT_TCSA2_ICLR               *((volatile unsigned int*)(0x42402c24UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZE              *((volatile unsigned int*)(0x42402c34UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZF              *((volatile unsigned int*)(0x42402c38UL))
#define bFM4_MFT0_FRT_TCSA2_ECKE               *((volatile unsigned int*)(0x42402c3cUL))
#define bFM4_MFT0_FRT_TCAL_STOP00              *((volatile unsigned int*)(0x42402c80UL))
#define bFM4_MFT0_FRT_TCAL_STOP01              *((volatile unsigned int*)(0x42402c84UL))
#define bFM4_MFT0_FRT_TCAL_STOP02              *((volatile unsigned int*)(0x42402c88UL))
#define bFM4_MFT0_FRT_TCAL_STOP10              *((volatile unsigned int*)(0x42402c8cUL))
#define bFM4_MFT0_FRT_TCAL_STOP11              *((volatile unsigned int*)(0x42402c90UL))
#define bFM4_MFT0_FRT_TCAL_STOP12              *((volatile unsigned int*)(0x42402c94UL))
#define bFM4_MFT0_FRT_TCAL_STOP20              *((volatile unsigned int*)(0x42402c98UL))
#define bFM4_MFT0_FRT_TCAL_STOP21              *((volatile unsigned int*)(0x42402c9cUL))
#define bFM4_MFT0_FRT_TCAL_STOP22              *((volatile unsigned int*)(0x42402ca0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR00              *((volatile unsigned int*)(0x42402cc0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR01              *((volatile unsigned int*)(0x42402cc4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR02              *((volatile unsigned int*)(0x42402cc8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR10              *((volatile unsigned int*)(0x42402cccUL))
#define bFM4_MFT0_FRT_TCAL_SCLR11              *((volatile unsigned int*)(0x42402cd0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR12              *((volatile unsigned int*)(0x42402cd4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR20              *((volatile unsigned int*)(0x42402cd8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR21              *((volatile unsigned int*)(0x42402cdcUL))
#define bFM4_MFT0_FRT_TCAL_SCLR22              *((volatile unsigned int*)(0x42402ce0UL))

/* Multifunction Timer unit 0 Output Compare Unit registers */
#define bFM4_MFT0_OCU_OCSA10_CST0              *((volatile unsigned int*)(0x42402300UL))
#define bFM4_MFT0_OCU_OCSA10_CST1              *((volatile unsigned int*)(0x42402304UL))
#define bFM4_MFT0_OCU_OCSA10_IOE0              *((volatile unsigned int*)(0x42402310UL))
#define bFM4_MFT0_OCU_OCSA10_IOE1              *((volatile unsigned int*)(0x42402314UL))
#define bFM4_MFT0_OCU_OCSA10_IOP0              *((volatile unsigned int*)(0x42402318UL))
#define bFM4_MFT0_OCU_OCSA10_IOP1              *((volatile unsigned int*)(0x4240231cUL))
#define bFM4_MFT0_OCU_OCSB10_OTD0              *((volatile unsigned int*)(0x42402320UL))
#define bFM4_MFT0_OCU_OCSB10_OTD1              *((volatile unsigned int*)(0x42402324UL))
#define bFM4_MFT0_OCU_OCSB10_CMOD              *((volatile unsigned int*)(0x42402330UL))
#define bFM4_MFT0_OCU_OCSB10_FM4               *((volatile unsigned int*)(0x4240233cUL))
#define bFM4_MFT0_OCU_OCSA32_CST0              *((volatile unsigned int*)(0x42402380UL))
#define bFM4_MFT0_OCU_OCSA32_CST1              *((volatile unsigned int*)(0x42402384UL))
#define bFM4_MFT0_OCU_OCSA32_IOE0              *((volatile unsigned int*)(0x42402390UL))
#define bFM4_MFT0_OCU_OCSA32_IOE1              *((volatile unsigned int*)(0x42402394UL))
#define bFM4_MFT0_OCU_OCSA32_IOP0              *((volatile unsigned int*)(0x42402398UL))
#define bFM4_MFT0_OCU_OCSA32_IOP1              *((volatile unsigned int*)(0x4240239cUL))
#define bFM4_MFT0_OCU_OCSB32_OTD0              *((volatile unsigned int*)(0x424023a0UL))
#define bFM4_MFT0_OCU_OCSB32_OTD1              *((volatile unsigned int*)(0x424023a4UL))
#define bFM4_MFT0_OCU_OCSB32_CMOD              *((volatile unsigned int*)(0x424023b0UL))
#define bFM4_MFT0_OCU_OCSB32_FM4               *((volatile unsigned int*)(0x424023bcUL))
#define bFM4_MFT0_OCU_OCSA54_CST0              *((volatile unsigned int*)(0x42402400UL))
#define bFM4_MFT0_OCU_OCSA54_CST1              *((volatile unsigned int*)(0x42402404UL))
#define bFM4_MFT0_OCU_OCSA54_IOE0              *((volatile unsigned int*)(0x42402410UL))
#define bFM4_MFT0_OCU_OCSA54_IOE1              *((volatile unsigned int*)(0x42402414UL))
#define bFM4_MFT0_OCU_OCSA54_IOP0              *((volatile unsigned int*)(0x42402418UL))
#define bFM4_MFT0_OCU_OCSA54_IOP1              *((volatile unsigned int*)(0x4240241cUL))
#define bFM4_MFT0_OCU_OCSB54_OTD0              *((volatile unsigned int*)(0x42402420UL))
#define bFM4_MFT0_OCU_OCSB54_OTD1              *((volatile unsigned int*)(0x42402424UL))
#define bFM4_MFT0_OCU_OCSB54_CMOD              *((volatile unsigned int*)(0x42402430UL))
#define bFM4_MFT0_OCU_OCSB54_FM4               *((volatile unsigned int*)(0x4240243cUL))
#define bFM4_MFT0_OCU_OCSC_MOD0                *((volatile unsigned int*)(0x424024a0UL))
#define bFM4_MFT0_OCU_OCSC_MOD1                *((volatile unsigned int*)(0x424024a4UL))
#define bFM4_MFT0_OCU_OCSC_MOD2                *((volatile unsigned int*)(0x424024a8UL))
#define bFM4_MFT0_OCU_OCSC_MOD3                *((volatile unsigned int*)(0x424024acUL))
#define bFM4_MFT0_OCU_OCSC_MOD4                *((volatile unsigned int*)(0x424024b0UL))
#define bFM4_MFT0_OCU_OCSC_MOD5                *((volatile unsigned int*)(0x424024b4UL))
#define bFM4_MFT0_OCU_OCFS10_FSO00             *((volatile unsigned int*)(0x42402d00UL))
#define bFM4_MFT0_OCU_OCFS10_FSO01             *((volatile unsigned int*)(0x42402d04UL))
#define bFM4_MFT0_OCU_OCFS10_FSO02             *((volatile unsigned int*)(0x42402d08UL))
#define bFM4_MFT0_OCU_OCFS10_FSO03             *((volatile unsigned int*)(0x42402d0cUL))
#define bFM4_MFT0_OCU_OCFS10_FSO10             *((volatile unsigned int*)(0x42402d10UL))
#define bFM4_MFT0_OCU_OCFS10_FSO11             *((volatile unsigned int*)(0x42402d14UL))
#define bFM4_MFT0_OCU_OCFS10_FSO12             *((volatile unsigned int*)(0x42402d18UL))
#define bFM4_MFT0_OCU_OCFS10_FSO13             *((volatile unsigned int*)(0x42402d1cUL))
#define bFM4_MFT0_OCU_OCFS32_FSO00             *((volatile unsigned int*)(0x42402d20UL))
#define bFM4_MFT0_OCU_OCFS32_FSO01             *((volatile unsigned int*)(0x42402d24UL))
#define bFM4_MFT0_OCU_OCFS32_FSO02             *((volatile unsigned int*)(0x42402d28UL))
#define bFM4_MFT0_OCU_OCFS32_FSO03             *((volatile unsigned int*)(0x42402d2cUL))
#define bFM4_MFT0_OCU_OCFS32_FSO10             *((volatile unsigned int*)(0x42402d30UL))
#define bFM4_MFT0_OCU_OCFS32_FSO11             *((volatile unsigned int*)(0x42402d34UL))
#define bFM4_MFT0_OCU_OCFS32_FSO12             *((volatile unsigned int*)(0x42402d38UL))
#define bFM4_MFT0_OCU_OCFS32_FSO13             *((volatile unsigned int*)(0x42402d3cUL))
#define bFM4_MFT0_OCU_OCFS54_FSO00             *((volatile unsigned int*)(0x42402d40UL))
#define bFM4_MFT0_OCU_OCFS54_FSO01             *((volatile unsigned int*)(0x42402d44UL))
#define bFM4_MFT0_OCU_OCFS54_FSO02             *((volatile unsigned int*)(0x42402d48UL))
#define bFM4_MFT0_OCU_OCFS54_FSO03             *((volatile unsigned int*)(0x42402d4cUL))
#define bFM4_MFT0_OCU_OCFS54_FSO10             *((volatile unsigned int*)(0x42402d50UL))
#define bFM4_MFT0_OCU_OCFS54_FSO11             *((volatile unsigned int*)(0x42402d54UL))
#define bFM4_MFT0_OCU_OCFS54_FSO12             *((volatile unsigned int*)(0x42402d58UL))
#define bFM4_MFT0_OCU_OCFS54_FSO13             *((volatile unsigned int*)(0x42402d5cUL))

/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT0_WFG_WFSA10_DCK0              *((volatile unsigned int*)(0x42403480UL))
#define bFM4_MFT0_WFG_WFSA10_DCK1              *((volatile unsigned int*)(0x42403484UL))
#define bFM4_MFT0_WFG_WFSA10_DCK2              *((volatile unsigned int*)(0x42403488UL))
#define bFM4_MFT0_WFG_WFSA10_GTEN0             *((volatile unsigned int*)(0x42403498UL))
#define bFM4_MFT0_WFG_WFSA10_GTEN1             *((volatile unsigned int*)(0x4240349cUL))
#define bFM4_MFT0_WFG_WFSA10_PSEL0             *((volatile unsigned int*)(0x424034a0UL))
#define bFM4_MFT0_WFG_WFSA10_PSEL1             *((volatile unsigned int*)(0x424034a4UL))
#define bFM4_MFT0_WFG_WFSA10_PGEN0             *((volatile unsigned int*)(0x424034a8UL))
#define bFM4_MFT0_WFG_WFSA10_PGEN1             *((volatile unsigned int*)(0x424034acUL))
#define bFM4_MFT0_WFG_WFSA32_DCK0              *((volatile unsigned int*)(0x42403500UL))
#define bFM4_MFT0_WFG_WFSA32_DCK1              *((volatile unsigned int*)(0x42403504UL))
#define bFM4_MFT0_WFG_WFSA32_DCK2              *((volatile unsigned int*)(0x42403508UL))
#define bFM4_MFT0_WFG_WFSA32_GTEN0             *((volatile unsigned int*)(0x42403518UL))
#define bFM4_MFT0_WFG_WFSA32_GTEN1             *((volatile unsigned int*)(0x4240351cUL))
#define bFM4_MFT0_WFG_WFSA32_PSEL0             *((volatile unsigned int*)(0x42403520UL))
#define bFM4_MFT0_WFG_WFSA32_PSEL1             *((volatile unsigned int*)(0x42403524UL))
#define bFM4_MFT0_WFG_WFSA32_PGEN0             *((volatile unsigned int*)(0x42403528UL))
#define bFM4_MFT0_WFG_WFSA32_PGEN1             *((volatile unsigned int*)(0x4240352cUL))
#define bFM4_MFT0_WFG_WFSA54_DCK0              *((volatile unsigned int*)(0x42403580UL))
#define bFM4_MFT0_WFG_WFSA54_DCK1              *((volatile unsigned int*)(0x42403584UL))
#define bFM4_MFT0_WFG_WFSA54_DCK2              *((volatile unsigned int*)(0x42403588UL))
#define bFM4_MFT0_WFG_WFSA54_GTEN0             *((volatile unsigned int*)(0x42403598UL))
#define bFM4_MFT0_WFG_WFSA54_GTEN1             *((volatile unsigned int*)(0x4240359cUL))
#define bFM4_MFT0_WFG_WFSA54_PSEL0             *((volatile unsigned int*)(0x424035a0UL))
#define bFM4_MFT0_WFG_WFSA54_PSEL1             *((volatile unsigned int*)(0x424035a4UL))
#define bFM4_MFT0_WFG_WFSA54_PGEN0             *((volatile unsigned int*)(0x424035a8UL))
#define bFM4_MFT0_WFG_WFSA54_PGEN1             *((volatile unsigned int*)(0x424035acUL))
#define bFM4_MFT0_WFG_WFIR_DTIFA               *((volatile unsigned int*)(0x42403600UL))
#define bFM4_MFT0_WFG_WFIR_DTICA               *((volatile unsigned int*)(0x42403604UL))
#define bFM4_MFT0_WFG_WFIR_DTIFB               *((volatile unsigned int*)(0x42403608UL))
#define bFM4_MFT0_WFG_WFIR_DTICB               *((volatile unsigned int*)(0x4240360cUL))
#define bFM4_MFT0_WFG_WFIR_TMIF10              *((volatile unsigned int*)(0x42403610UL))
#define bFM4_MFT0_WFG_WFIR_TMIC10              *((volatile unsigned int*)(0x42403614UL))
#define bFM4_MFT0_WFG_WFIR_TMIE10              *((volatile unsigned int*)(0x42403618UL))
#define bFM4_MFT0_WFG_WFIR_TMIS10              *((volatile unsigned int*)(0x4240361cUL))
#define bFM4_MFT0_WFG_WFIR_TMIF32              *((volatile unsigned int*)(0x42403620UL))
#define bFM4_MFT0_WFG_WFIR_TMIC32              *((volatile unsigned int*)(0x42403624UL))
#define bFM4_MFT0_WFG_WFIR_TMIE32              *((volatile unsigned int*)(0x42403628UL))
#define bFM4_MFT0_WFG_WFIR_TMIS32              *((volatile unsigned int*)(0x4240362cUL))
#define bFM4_MFT0_WFG_WFIR_TMIF54              *((volatile unsigned int*)(0x42403630UL))
#define bFM4_MFT0_WFG_WFIR_TMIC54              *((volatile unsigned int*)(0x42403634UL))
#define bFM4_MFT0_WFG_WFIR_TMIE54              *((volatile unsigned int*)(0x42403638UL))
#define bFM4_MFT0_WFG_WFIR_TMIS54              *((volatile unsigned int*)(0x4240363cUL))
#define bFM4_MFT0_WFG_NZCL_DTIEA               *((volatile unsigned int*)(0x42403680UL))
#define bFM4_MFT0_WFG_NZCL_NWS0                *((volatile unsigned int*)(0x42403684UL))
#define bFM4_MFT0_WFG_NZCL_NWS1                *((volatile unsigned int*)(0x42403688UL))
#define bFM4_MFT0_WFG_NZCL_NWS2                *((volatile unsigned int*)(0x4240368cUL))
#define bFM4_MFT0_WFG_NZCL_SDTI                *((volatile unsigned int*)(0x42403690UL))
#define bFM4_MFT0_WFG_NZCL_DTIEB               *((volatile unsigned int*)(0x42403694UL))
#define bFM4_MFT0_WFG_NZCL_DIMA                *((volatile unsigned int*)(0x424036a0UL))
#define bFM4_MFT0_WFG_NZCL_DIMB                *((volatile unsigned int*)(0x424036a4UL))
#define bFM4_MFT0_WFG_NZCL_WIM10               *((volatile unsigned int*)(0x424036b0UL))
#define bFM4_MFT0_WFG_NZCL_WIM32               *((volatile unsigned int*)(0x424036b4UL))
#define bFM4_MFT0_WFG_NZCL_WIM54               *((volatile unsigned int*)(0x424036b8UL))

