snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* General purpose I/O registers */
#define bFM4_GPIO_PFR0_P00                     *((volatile unsigned int*)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P01                     *((volatile unsigned int*)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P02                     *((volatile unsigned int*)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P03                     *((volatile unsigned int*)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P04                     *((volatile unsigned int*)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P05                     *((volatile unsigned int*)(0x42DE0014UL))
#define bFM4_GPIO_PFR0_P06                     *((volatile unsigned int*)(0x42DE0018UL))
#define bFM4_GPIO_PFR0_P07                     *((volatile unsigned int*)(0x42DE001CUL))
#define bFM4_GPIO_PFR0_P08                     *((volatile unsigned int*)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P09                     *((volatile unsigned int*)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_P0A                     *((volatile unsigned int*)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_P0B                     *((volatile unsigned int*)(0x42DE002CUL))
#define bFM4_GPIO_PFR0_P0C                     *((volatile unsigned int*)(0x42DE0030UL))
#define bFM4_GPIO_PFR0_P0D                     *((volatile unsigned int*)(0x42DE0034UL))
#define bFM4_GPIO_PFR0_P0E                     *((volatile unsigned int*)(0x42DE0038UL))
#define bFM4_GPIO_PFR1_P10                     *((volatile unsigned int*)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P11                     *((volatile unsigned int*)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P12                     *((volatile unsigned int*)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P13                     *((volatile unsigned int*)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P14                     *((volatile unsigned int*)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P15                     *((volatile unsigned int*)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P16                     *((volatile unsigned int*)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P17                     *((volatile unsigned int*)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P18                     *((volatile unsigned int*)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P19                     *((volatile unsigned int*)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_P1A                     *((volatile unsigned int*)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_P1B                     *((volatile unsigned int*)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_P1C                     *((volatile unsigned int*)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_P1D                     *((volatile unsigned int*)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_P1E                     *((volatile unsigned int*)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_P1F                     *((volatile unsigned int*)(0x42DE00BCUL))
#define bFM4_GPIO_PFR2_P20                     *((volatile unsigned int*)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P21                     *((volatile unsigned int*)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P22                     *((volatile unsigned int*)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P23                     *((volatile unsigned int*)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P24                     *((volatile unsigned int*)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P25                     *((volatile unsigned int*)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P26                     *((volatile unsigned int*)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P27                     *((volatile unsigned int*)(0x42DE011CUL))
#define bFM4_GPIO_PFR3_P30                     *((volatile unsigned int*)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P31                     *((volatile unsigned int*)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P32                     *((volatile unsigned int*)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P33                     *((volatile unsigned int*)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P34                     *((volatile unsigned int*)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P35                     *((volatile unsigned int*)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P36                     *((volatile unsigned int*)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P37                     *((volatile unsigned int*)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P38                     *((volatile unsigned int*)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P39                     *((volatile unsigned int*)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_P3A                     *((volatile unsigned int*)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_P3B                     *((volatile unsigned int*)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_P3C                     *((volatile unsigned int*)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_P3D                     *((volatile unsigned int*)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_P3E                     *((volatile unsigned int*)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_P3F                     *((volatile unsigned int*)(0x42DE01BCUL))
#define bFM4_GPIO_PFR4_P40                     *((volatile unsigned int*)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P41                     *((volatile unsigned int*)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P42                     *((volatile unsigned int*)(0x42DE0208UL))
#define bFM4_GPIO_PFR4_P43                     *((volatile unsigned int*)(0x42DE020CUL))
#define bFM4_GPIO_PFR4_P44                     *((volatile unsigned int*)(0x42DE0210UL))
#define bFM4_GPIO_PFR4_P45                     *((volatile unsigned int*)(0x42DE0214UL))
#define bFM4_GPIO_PFR4_P46                     *((volatile unsigned int*)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P47                     *((volatile unsigned int*)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P48                     *((volatile unsigned int*)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P49                     *((volatile unsigned int*)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_P4A                     *((volatile unsigned int*)(0x42DE0228UL))
#define bFM4_GPIO_PFR4_P4B                     *((volatile unsigned int*)(0x42DE022CUL))
#define bFM4_GPIO_PFR4_P4C                     *((volatile unsigned int*)(0x42DE0230UL))
#define bFM4_GPIO_PFR4_P4D                     *((volatile unsigned int*)(0x42DE0234UL))
#define bFM4_GPIO_PFR4_P4E                     *((volatile unsigned int*)(0x42DE0238UL))
#define bFM4_GPIO_PFR5_P50                     *((volatile unsigned int*)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P51                     *((volatile unsigned int*)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P52                     *((volatile unsigned int*)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P53                     *((volatile unsigned int*)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P54                     *((volatile unsigned int*)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P55                     *((volatile unsigned int*)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P56                     *((volatile unsigned int*)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P57                     *((volatile unsigned int*)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P58                     *((volatile unsigned int*)(0x42DE02A0UL))
#define bFM4_GPIO_PFR5_P59                     *((volatile unsigned int*)(0x42DE02A4UL))
#define bFM4_GPIO_PFR5_P5A                     *((volatile unsigned int*)(0x42DE02A8UL))
#define bFM4_GPIO_PFR5_P5B                     *((volatile unsigned int*)(0x42DE02ACUL))
#define bFM4_GPIO_PFR6_P60                     *((volatile unsigned int*)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P61                     *((volatile unsigned int*)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P62                     *((volatile unsigned int*)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P63                     *((volatile unsigned int*)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P64                     *((volatile unsigned int*)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P65                     *((volatile unsigned int*)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P66                     *((volatile unsigned int*)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P67                     *((volatile unsigned int*)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P68                     *((volatile unsigned int*)(0x42DE0320UL))
#define bFM4_GPIO_PFR7_P70                     *((volatile unsigned int*)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P71                     *((volatile unsigned int*)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P72                     *((volatile unsigned int*)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P73                     *((volatile unsigned int*)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P74                     *((volatile unsigned int*)(0x42DE0390UL))
#define bFM4_GPIO_PFR8_P80                     *((volatile unsigned int*)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P81                     *((volatile unsigned int*)(0x42DE0404UL))
#define bFM4_GPIO_PFRE_PE0                     *((volatile unsigned int*)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_PE2                     *((volatile unsigned int*)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_PE3                     *((volatile unsigned int*)(0x42DE070CUL))
#define bFM4_GPIO_PCR0_P00                     *((volatile unsigned int*)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P01                     *((volatile unsigned int*)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P02                     *((volatile unsigned int*)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P03                     *((volatile unsigned int*)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P04                     *((volatile unsigned int*)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P05                     *((volatile unsigned int*)(0x42DE2014UL))
#define bFM4_GPIO_PCR0_P06                     *((volatile unsigned int*)(0x42DE2018UL))
#define bFM4_GPIO_PCR0_P07                     *((volatile unsigned int*)(0x42DE201CUL))
#define bFM4_GPIO_PCR0_P08                     *((volatile unsigned int*)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P09                     *((volatile unsigned int*)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_P0A                     *((volatile unsigned int*)(0x42DE2028UL))
#define bFM4_GPIO_PCR0_P0B                     *((volatile unsigned int*)(0x42DE202CUL))
#define bFM4_GPIO_PCR0_P0C                     *((volatile unsigned int*)(0x42DE2030UL))
#define bFM4_GPIO_PCR0_P0D                     *((volatile unsigned int*)(0x42DE2034UL))
#define bFM4_GPIO_PCR0_P0E                     *((volatile unsigned int*)(0x42DE2038UL))
#define bFM4_GPIO_PCR1_P10                     *((volatile unsigned int*)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P11                     *((volatile unsigned int*)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P12                     *((volatile unsigned int*)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P13                     *((volatile unsigned int*)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P14                     *((volatile unsigned int*)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P15                     *((volatile unsigned int*)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P16                     *((volatile unsigned int*)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P17                     *((volatile unsigned int*)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P18                     *((volatile unsigned int*)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P19                     *((volatile unsigned int*)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_P1A                     *((volatile unsigned int*)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_P1B                     *((volatile unsigned int*)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_P1C                     *((volatile unsigned int*)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_P1D                     *((volatile unsigned int*)(0x42DE20B4UL))
#define bFM4_GPIO_PCR1_P1E                     *((volatile unsigned int*)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_P1F                     *((volatile unsigned int*)(0x42DE20BCUL))
#define bFM4_GPIO_PCR2_P20                     *((volatile unsigned int*)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P21                     *((volatile unsigned int*)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P22                     *((volatile unsigned int*)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P23                     *((volatile unsigned int*)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P24                     *((volatile unsigned int*)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P25                     *((volatile unsigned int*)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P26                     *((volatile unsigned int*)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P27                     *((volatile unsigned int*)(0x42DE211CUL))
#define bFM4_GPIO_PCR3_P30                     *((volatile unsigned int*)(0x42DE2180UL))
#define bFM4_GPIO_PCR3_P31                     *((volatile unsigned int*)(0x42DE2184UL))
#define bFM4_GPIO_PCR3_P32                     *((volatile unsigned int*)(0x42DE2188UL))
#define bFM4_GPIO_PCR3_P33                     *((volatile unsigned int*)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P34                     *((volatile unsigned int*)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P35                     *((volatile unsigned int*)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P36                     *((volatile unsigned int*)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P37                     *((volatile unsigned int*)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P38                     *((volatile unsigned int*)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P39                     *((volatile unsigned int*)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_P3A                     *((volatile unsigned int*)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_P3B                     *((volatile unsigned int*)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_P3C                     *((volatile unsigned int*)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_P3D                     *((volatile unsigned int*)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_P3E                     *((volatile unsigned int*)(0x42DE21B8UL))
#define bFM4_GPIO_PCR3_P3F                     *((volatile unsigned int*)(0x42DE21BCUL))
#define bFM4_GPIO_PCR4_P40                     *((volatile unsigned int*)(0x42DE2200UL))
#define bFM4_GPIO_PCR4_P41                     *((volatile unsigned int*)(0x42DE2204UL))
#define bFM4_GPIO_PCR4_P42                     *((volatile unsigned int*)(0x42DE2208UL))
#define bFM4_GPIO_PCR4_P43                     *((volatile unsigned int*)(0x42DE220CUL))
#define bFM4_GPIO_PCR4_P44                     *((volatile unsigned int*)(0x42DE2210UL))
#define bFM4_GPIO_PCR4_P45                     *((volatile unsigned int*)(0x42DE2214UL))
#define bFM4_GPIO_PCR4_P46                     *((volatile unsigned int*)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P47                     *((volatile unsigned int*)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P48                     *((volatile unsigned int*)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P49                     *((volatile unsigned int*)(0x42DE2224UL))
#define bFM4_GPIO_PCR4_P4A                     *((volatile unsigned int*)(0x42DE2228UL))
#define bFM4_GPIO_PCR4_P4B                     *((volatile unsigned int*)(0x42DE222CUL))
#define bFM4_GPIO_PCR4_P4C                     *((volatile unsigned int*)(0x42DE2230UL))
#define bFM4_GPIO_PCR4_P4D                     *((volatile unsigned int*)(0x42DE2234UL))
#define bFM4_GPIO_PCR4_P4E                     *((volatile unsigned int*)(0x42DE2238UL))
#define bFM4_GPIO_PCR5_P50                     *((volatile unsigned int*)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P51                     *((volatile unsigned int*)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P52                     *((volatile unsigned int*)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P53                     *((volatile unsigned int*)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P54                     *((volatile unsigned int*)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P55                     *((volatile unsigned int*)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P56                     *((volatile unsigned int*)(0x42DE2298UL))
#define bFM4_GPIO_PCR5_P57                     *((volatile unsigned int*)(0x42DE229CUL))
#define bFM4_GPIO_PCR5_P58                     *((volatile unsigned int*)(0x42DE22A0UL))
#define bFM4_GPIO_PCR5_P59                     *((volatile unsigned int*)(0x42DE22A4UL))
#define bFM4_GPIO_PCR5_P5A                     *((volatile unsigned int*)(0x42DE22A8UL))
#define bFM4_GPIO_PCR5_P5B                     *((volatile unsigned int*)(0x42DE22ACUL))
#define bFM4_GPIO_PCR6_P60                     *((volatile unsigned int*)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P61                     *((volatile unsigned int*)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P62                     *((volatile unsigned int*)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P63                     *((volatile unsigned int*)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P64                     *((volatile unsigned int*)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P65                     *((volatile unsigned int*)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P66                     *((volatile unsigned int*)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P67                     *((volatile unsigned int*)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P68                     *((volatile unsigned int*)(0x42DE2320UL))
#define bFM4_GPIO_PCR7_P70                     *((volatile unsigned int*)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P71                     *((volatile unsigned int*)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P72                     *((volatile unsigned int*)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P73                     *((volatile unsigned int*)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P74                     *((volatile unsigned int*)(0x42DE2390UL))
#define bFM4_GPIO_PCR8_P80                     *((volatile unsigned int*)(0x42DE2400UL))
#define bFM4_GPIO_PCR8_P81                     *((volatile unsigned int*)(0x42DE2404UL))
#define bFM4_GPIO_PCRE_PE0                     *((volatile unsigned int*)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_PE2                     *((volatile unsigned int*)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_PE3                     *((volatile unsigned int*)(0x42DE270CUL))
#define bFM4_GPIO_DDR0_P00                     *((volatile unsigned int*)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P01                     *((volatile unsigned int*)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P02                     *((volatile unsigned int*)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P03                     *((volatile unsigned int*)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P04                     *((volatile unsigned int*)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P05                     *((volatile unsigned int*)(0x42DE4014UL))
#define bFM4_GPIO_DDR0_P06                     *((volatile unsigned int*)(0x42DE4018UL))
#define bFM4_GPIO_DDR0_P07                     *((volatile unsigned int*)(0x42DE401CUL))
#define bFM4_GPIO_DDR0_P08                     *((volatile unsigned int*)(0x42DE4020UL))
#define bFM4_GPIO_DDR0_P09                     *((volatile unsigned int*)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_P0A                     *((volatile unsigned int*)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_P0B                     *((volatile unsigned int*)(0x42DE402CUL))
#define bFM4_GPIO_DDR0_P0C                     *((volatile unsigned int*)(0x42DE4030UL))
#define bFM4_GPIO_DDR0_P0D                     *((volatile unsigned int*)(0x42DE4034UL))
#define bFM4_GPIO_DDR0_P0E                     *((volatile unsigned int*)(0x42DE4038UL))
#define bFM4_GPIO_DDR0_P0F                     *((volatile unsigned int*)(0x42DE403CUL))
#define bFM4_GPIO_DDR1_P10                     *((volatile unsigned int*)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P11                     *((volatile unsigned int*)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P12                     *((volatile unsigned int*)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P13                     *((volatile unsigned int*)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P14                     *((volatile unsigned int*)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P15                     *((volatile unsigned int*)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P16                     *((volatile unsigned int*)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P17                     *((volatile unsigned int*)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P18                     *((volatile unsigned int*)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P19                     *((volatile unsigned int*)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_P1A                     *((volatile unsigned int*)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_P1B                     *((volatile unsigned int*)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_P1C                     *((volatile unsigned int*)(0x42DE40B0UL))
#define bFM4_GPIO_DDR1_P1D                     *((volatile unsigned int*)(0x42DE40B4UL))
#define bFM4_GPIO_DDR1_P1E                     *((volatile unsigned int*)(0x42DE40B8UL))
#define bFM4_GPIO_DDR1_P1F                     *((volatile unsigned int*)(0x42DE40BCUL))
#define bFM4_GPIO_DDR2_P20                     *((volatile unsigned int*)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P21                     *((volatile unsigned int*)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P22                     *((volatile unsigned int*)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P23                     *((volatile unsigned int*)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P24                     *((volatile unsigned int*)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P25                     *((volatile unsigned int*)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P26                     *((volatile unsigned int*)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P27                     *((volatile unsigned int*)(0x42DE411CUL))
#define bFM4_GPIO_DDR3_P30                     *((volatile unsigned int*)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P31                     *((volatile unsigned int*)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P32                     *((volatile unsigned int*)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P33                     *((volatile unsigned int*)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P34                     *((volatile unsigned int*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P35                     *((volatile unsigned int*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P36                     *((volatile unsigned int*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P37                     *((volatile unsigned int*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P38                     *((volatile unsigned int*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P39                     *((volatile unsigned int*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_P3A                     *((volatile unsigned int*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_P3B                     *((volatile unsigned int*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_P3C                     *((volatile unsigned int*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_P3D                     *((volatile unsigned int*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_P3E                     *((volatile unsigned int*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_P3F                     *((volatile unsigned int*)(0x42DE41BCUL))
#define bFM4_GPIO_DDR4_P40                     *((volatile unsigned int*)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P41                     *((volatile unsigned int*)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P42                     *((volatile unsigned int*)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P43                     *((volatile unsigned int*)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P44                     *((volatile unsigned int*)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P45                     *((volatile unsigned int*)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P46                     *((volatile unsigned int*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P47                     *((volatile unsigned int*)(0x42DE421CUL))
