snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS I2C channel 2 registers */
#define bFM4_MFS2_I2C_SMR_TIE                  *((volatile unsigned int*)(0x42704008UL))
#define bFM4_MFS2_I2C_SMR_RIE                  *((volatile unsigned int*)(0x4270400CUL))
#define bFM4_MFS2_I2C_SMR_MD0                  *((volatile unsigned int*)(0x42704014UL))
#define bFM4_MFS2_I2C_SMR_MD1                  *((volatile unsigned int*)(0x42704018UL))
#define bFM4_MFS2_I2C_SMR_MD2                  *((volatile unsigned int*)(0x4270401CUL))
#define bFM4_MFS2_I2C_IBCR_INT                 *((volatile unsigned int*)(0x42704020UL))
#define bFM4_MFS2_I2C_IBCR_BER                 *((volatile unsigned int*)(0x42704024UL))
#define bFM4_MFS2_I2C_IBCR_INTE                *((volatile unsigned int*)(0x42704028UL))
#define bFM4_MFS2_I2C_IBCR_CNDE                *((volatile unsigned int*)(0x4270402CUL))
#define bFM4_MFS2_I2C_IBCR_WSEL                *((volatile unsigned int*)(0x42704030UL))
#define bFM4_MFS2_I2C_IBCR_ACKE                *((volatile unsigned int*)(0x42704034UL))
#define bFM4_MFS2_I2C_IBCR_ACT                 *((volatile unsigned int*)(0x42704038UL))
#define bFM4_MFS2_I2C_IBCR_SCC                 *((volatile unsigned int*)(0x42704038UL))
#define bFM4_MFS2_I2C_IBCR_MSS                 *((volatile unsigned int*)(0x4270403CUL))
#define bFM4_MFS2_I2C_IBSR_BB                  *((volatile unsigned int*)(0x42704080UL))
#define bFM4_MFS2_I2C_IBSR_SPC                 *((volatile unsigned int*)(0x42704084UL))
#define bFM4_MFS2_I2C_IBSR_RSC                 *((volatile unsigned int*)(0x42704088UL))
#define bFM4_MFS2_I2C_IBSR_AL                  *((volatile unsigned int*)(0x4270408CUL))
#define bFM4_MFS2_I2C_IBSR_TRX                 *((volatile unsigned int*)(0x42704090UL))
#define bFM4_MFS2_I2C_IBSR_RSA                 *((volatile unsigned int*)(0x42704094UL))
#define bFM4_MFS2_I2C_IBSR_RACK                *((volatile unsigned int*)(0x42704098UL))
#define bFM4_MFS2_I2C_IBSR_FBT                 *((volatile unsigned int*)(0x4270409CUL))
#define bFM4_MFS2_I2C_SSR_TBI                  *((volatile unsigned int*)(0x427040A0UL))
#define bFM4_MFS2_I2C_SSR_TDRE                 *((volatile unsigned int*)(0x427040A4UL))
#define bFM4_MFS2_I2C_SSR_RDRF                 *((volatile unsigned int*)(0x427040A8UL))
#define bFM4_MFS2_I2C_SSR_ORE                  *((volatile unsigned int*)(0x427040ACUL))
#define bFM4_MFS2_I2C_SSR_TBIE                 *((volatile unsigned int*)(0x427040B0UL))
#define bFM4_MFS2_I2C_SSR_DMA                  *((volatile unsigned int*)(0x427040B4UL))
#define bFM4_MFS2_I2C_SSR_TSET                 *((volatile unsigned int*)(0x427040B8UL))
#define bFM4_MFS2_I2C_SSR_REC                  *((volatile unsigned int*)(0x427040BCUL))
#define bFM4_MFS2_I2C_ISBA_SA0                 *((volatile unsigned int*)(0x42704200UL))
#define bFM4_MFS2_I2C_ISBA_SA1                 *((volatile unsigned int*)(0x42704204UL))
#define bFM4_MFS2_I2C_ISBA_SA2                 *((volatile unsigned int*)(0x42704208UL))
#define bFM4_MFS2_I2C_ISBA_SA3                 *((volatile unsigned int*)(0x4270420CUL))
#define bFM4_MFS2_I2C_ISBA_SA4                 *((volatile unsigned int*)(0x42704210UL))
#define bFM4_MFS2_I2C_ISBA_SA5                 *((volatile unsigned int*)(0x42704214UL))
#define bFM4_MFS2_I2C_ISBA_SA6                 *((volatile unsigned int*)(0x42704218UL))
#define bFM4_MFS2_I2C_ISBA_SAEN                *((volatile unsigned int*)(0x4270421CUL))
#define bFM4_MFS2_I2C_ISMK_SM0                 *((volatile unsigned int*)(0x42704220UL))
#define bFM4_MFS2_I2C_ISMK_SM1                 *((volatile unsigned int*)(0x42704224UL))
#define bFM4_MFS2_I2C_ISMK_SM2                 *((volatile unsigned int*)(0x42704228UL))
#define bFM4_MFS2_I2C_ISMK_SM3                 *((volatile unsigned int*)(0x4270422CUL))
#define bFM4_MFS2_I2C_ISMK_SM4                 *((volatile unsigned int*)(0x42704230UL))
#define bFM4_MFS2_I2C_ISMK_SM5                 *((volatile unsigned int*)(0x42704234UL))
#define bFM4_MFS2_I2C_ISMK_SM6                 *((volatile unsigned int*)(0x42704238UL))
#define bFM4_MFS2_I2C_ISMK_EN                  *((volatile unsigned int*)(0x4270423CUL))
#define bFM4_MFS2_I2C_FCR_FE1                  *((volatile unsigned int*)(0x42704280UL))
#define bFM4_MFS2_I2C_FCR_FE2                  *((volatile unsigned int*)(0x42704284UL))
#define bFM4_MFS2_I2C_FCR_FCL1                 *((volatile unsigned int*)(0x42704288UL))
#define bFM4_MFS2_I2C_FCR_FCL2                 *((volatile unsigned int*)(0x4270428CUL))
#define bFM4_MFS2_I2C_FCR_FSET                 *((volatile unsigned int*)(0x42704290UL))
#define bFM4_MFS2_I2C_FCR_FLD                  *((volatile unsigned int*)(0x42704294UL))
#define bFM4_MFS2_I2C_FCR_FLST                 *((volatile unsigned int*)(0x42704298UL))
#define bFM4_MFS2_I2C_FCR_FSEL                 *((volatile unsigned int*)(0x427042A0UL))
#define bFM4_MFS2_I2C_FCR_FTIE                 *((volatile unsigned int*)(0x427042A4UL))
#define bFM4_MFS2_I2C_FCR_FDRQ                 *((volatile unsigned int*)(0x427042A8UL))
#define bFM4_MFS2_I2C_FCR_FRIIE                *((volatile unsigned int*)(0x427042ACUL))
#define bFM4_MFS2_I2C_FCR_FLSTE                *((volatile unsigned int*)(0x427042B0UL))
#define bFM4_MFS2_I2C_FCR0_FE1                 *((volatile unsigned int*)(0x42704280UL))
#define bFM4_MFS2_I2C_FCR0_FE2                 *((volatile unsigned int*)(0x42704284UL))
#define bFM4_MFS2_I2C_FCR0_FCL1                *((volatile unsigned int*)(0x42704288UL))
#define bFM4_MFS2_I2C_FCR0_FCL2                *((volatile unsigned int*)(0x4270428CUL))
#define bFM4_MFS2_I2C_FCR0_FSET                *((volatile unsigned int*)(0x42704290UL))
#define bFM4_MFS2_I2C_FCR0_FLD                 *((volatile unsigned int*)(0x42704294UL))
#define bFM4_MFS2_I2C_FCR0_FLST                *((volatile unsigned int*)(0x42704298UL))
#define bFM4_MFS2_I2C_FCR1_FSEL                *((volatile unsigned int*)(0x427042A0UL))
#define bFM4_MFS2_I2C_FCR1_FTIE                *((volatile unsigned int*)(0x427042A4UL))
#define bFM4_MFS2_I2C_FCR1_FDRQ                *((volatile unsigned int*)(0x427042A8UL))
#define bFM4_MFS2_I2C_FCR1_FRIIE               *((volatile unsigned int*)(0x427042ACUL))
#define bFM4_MFS2_I2C_FCR1_FLSTE               *((volatile unsigned int*)(0x427042B0UL))
#define bFM4_MFS2_I2C_FBYTE_FD0                *((volatile unsigned int*)(0x42704300UL))
#define bFM4_MFS2_I2C_FBYTE_FD1                *((volatile unsigned int*)(0x42704304UL))
#define bFM4_MFS2_I2C_FBYTE_FD2                *((volatile unsigned int*)(0x42704308UL))
#define bFM4_MFS2_I2C_FBYTE_FD3                *((volatile unsigned int*)(0x4270430CUL))
#define bFM4_MFS2_I2C_FBYTE_FD4                *((volatile unsigned int*)(0x42704310UL))
#define bFM4_MFS2_I2C_FBYTE_FD5                *((volatile unsigned int*)(0x42704314UL))
#define bFM4_MFS2_I2C_FBYTE_FD6                *((volatile unsigned int*)(0x42704318UL))
#define bFM4_MFS2_I2C_FBYTE_FD7                *((volatile unsigned int*)(0x4270431CUL))
#define bFM4_MFS2_I2C_FBYTE_FD8                *((volatile unsigned int*)(0x42704320UL))
#define bFM4_MFS2_I2C_FBYTE_FD9                *((volatile unsigned int*)(0x42704324UL))
#define bFM4_MFS2_I2C_FBYTE_FD10               *((volatile unsigned int*)(0x42704328UL))
#define bFM4_MFS2_I2C_FBYTE_FD11               *((volatile unsigned int*)(0x4270432CUL))
#define bFM4_MFS2_I2C_FBYTE_FD12               *((volatile unsigned int*)(0x42704330UL))
#define bFM4_MFS2_I2C_FBYTE_FD13               *((volatile unsigned int*)(0x42704334UL))
#define bFM4_MFS2_I2C_FBYTE_FD14               *((volatile unsigned int*)(0x42704338UL))
#define bFM4_MFS2_I2C_FBYTE_FD15               *((volatile unsigned int*)(0x4270433CUL))
#define bFM4_MFS2_I2C_FBYTE1_FD0               *((volatile unsigned int*)(0x42704300UL))
#define bFM4_MFS2_I2C_FBYTE1_FD1               *((volatile unsigned int*)(0x42704304UL))
#define bFM4_MFS2_I2C_FBYTE1_FD2               *((volatile unsigned int*)(0x42704308UL))
#define bFM4_MFS2_I2C_FBYTE1_FD3               *((volatile unsigned int*)(0x4270430CUL))
#define bFM4_MFS2_I2C_FBYTE1_FD4               *((volatile unsigned int*)(0x42704310UL))
#define bFM4_MFS2_I2C_FBYTE1_FD5               *((volatile unsigned int*)(0x42704314UL))
#define bFM4_MFS2_I2C_FBYTE1_FD6               *((volatile unsigned int*)(0x42704318UL))
#define bFM4_MFS2_I2C_FBYTE1_FD7               *((volatile unsigned int*)(0x4270431CUL))
#define bFM4_MFS2_I2C_FBYTE2_FD8               *((volatile unsigned int*)(0x42704320UL))
#define bFM4_MFS2_I2C_FBYTE2_FD9               *((volatile unsigned int*)(0x42704324UL))
#define bFM4_MFS2_I2C_FBYTE2_FD10              *((volatile unsigned int*)(0x42704328UL))
#define bFM4_MFS2_I2C_FBYTE2_FD11              *((volatile unsigned int*)(0x4270432CUL))
#define bFM4_MFS2_I2C_FBYTE2_FD12              *((volatile unsigned int*)(0x42704330UL))
#define bFM4_MFS2_I2C_FBYTE2_FD13              *((volatile unsigned int*)(0x42704334UL))
#define bFM4_MFS2_I2C_FBYTE2_FD14              *((volatile unsigned int*)(0x42704338UL))
#define bFM4_MFS2_I2C_FBYTE2_FD15              *((volatile unsigned int*)(0x4270433CUL))

/* MFS UART channel 3 registers */
#define bFM4_MFS3_UART_SMR_SOE                 *((volatile unsigned int*)(0x42706000UL))
#define bFM4_MFS3_UART_SMR_BDS                 *((volatile unsigned int*)(0x42706008UL))
#define bFM4_MFS3_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270600CUL))
#define bFM4_MFS3_UART_SMR_WUCR                *((volatile unsigned int*)(0x42706010UL))
#define bFM4_MFS3_UART_SMR_MD0                 *((volatile unsigned int*)(0x42706014UL))
#define bFM4_MFS3_UART_SMR_MD1                 *((volatile unsigned int*)(0x42706018UL))
#define bFM4_MFS3_UART_SMR_MD2                 *((volatile unsigned int*)(0x4270601CUL))
#define bFM4_MFS3_UART_SCR_TXE                 *((volatile unsigned int*)(0x42706020UL))
#define bFM4_MFS3_UART_SCR_RXE                 *((volatile unsigned int*)(0x42706024UL))
#define bFM4_MFS3_UART_SCR_TBIE                *((volatile unsigned int*)(0x42706028UL))
#define bFM4_MFS3_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270602CUL))
#define bFM4_MFS3_UART_SCR_RIE                 *((volatile unsigned int*)(0x42706030UL))
#define bFM4_MFS3_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270603CUL))
#define bFM4_MFS3_UART_ESCR_L0                 *((volatile unsigned int*)(0x42706080UL))
#define bFM4_MFS3_UART_ESCR_L1                 *((volatile unsigned int*)(0x42706084UL))
#define bFM4_MFS3_UART_ESCR_L2                 *((volatile unsigned int*)(0x42706088UL))
#define bFM4_MFS3_UART_ESCR_P                  *((volatile unsigned int*)(0x4270608CUL))
#define bFM4_MFS3_UART_ESCR_PEN                *((volatile unsigned int*)(0x42706090UL))
#define bFM4_MFS3_UART_ESCR_INV                *((volatile unsigned int*)(0x42706094UL))
#define bFM4_MFS3_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42706098UL))
#define bFM4_MFS3_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270609CUL))
#define bFM4_MFS3_UART_SSR_TBI                 *((volatile unsigned int*)(0x427060A0UL))
#define bFM4_MFS3_UART_SSR_TDRE                *((volatile unsigned int*)(0x427060A4UL))
#define bFM4_MFS3_UART_SSR_RDRF                *((volatile unsigned int*)(0x427060A8UL))
#define bFM4_MFS3_UART_SSR_ORE                 *((volatile unsigned int*)(0x427060ACUL))
#define bFM4_MFS3_UART_SSR_FRE                 *((volatile unsigned int*)(0x427060B0UL))
#define bFM4_MFS3_UART_SSR_PE                  *((volatile unsigned int*)(0x427060B4UL))
#define bFM4_MFS3_UART_SSR_REC                 *((volatile unsigned int*)(0x427060BCUL))
#define bFM4_MFS3_UART_RDR_AD                  *((volatile unsigned int*)(0x42706120UL))
#define bFM4_MFS3_UART_TDR_AD                  *((volatile unsigned int*)(0x42706120UL))
#define bFM4_MFS3_UART_BGR_EXT                 *((volatile unsigned int*)(0x427061BCUL))
#define bFM4_MFS3_UART_BGR1_EXT                *((volatile unsigned int*)(0x427061BCUL))
#define bFM4_MFS3_UART_FCR_FE1                 *((volatile unsigned int*)(0x42706280UL))
#define bFM4_MFS3_UART_FCR_FE2                 *((volatile unsigned int*)(0x42706284UL))
#define bFM4_MFS3_UART_FCR_FCL1                *((volatile unsigned int*)(0x42706288UL))
#define bFM4_MFS3_UART_FCR_FCL2                *((volatile unsigned int*)(0x4270628CUL))
#define bFM4_MFS3_UART_FCR_FSET                *((volatile unsigned int*)(0x42706290UL))
#define bFM4_MFS3_UART_FCR_FLD                 *((volatile unsigned int*)(0x42706294UL))
#define bFM4_MFS3_UART_FCR_FLST                *((volatile unsigned int*)(0x42706298UL))
#define bFM4_MFS3_UART_FCR_FSEL                *((volatile unsigned int*)(0x427062A0UL))
#define bFM4_MFS3_UART_FCR_FTIE                *((volatile unsigned int*)(0x427062A4UL))
#define bFM4_MFS3_UART_FCR_FDRQ                *((volatile unsigned int*)(0x427062A8UL))
#define bFM4_MFS3_UART_FCR_FRIIE               *((volatile unsigned int*)(0x427062ACUL))
#define bFM4_MFS3_UART_FCR_FLSTE               *((volatile unsigned int*)(0x427062B0UL))
#define bFM4_MFS3_UART_FCR0_FE1                *((volatile unsigned int*)(0x42706280UL))
#define bFM4_MFS3_UART_FCR0_FE2                *((volatile unsigned int*)(0x42706284UL))
#define bFM4_MFS3_UART_FCR0_FCL1               *((volatile unsigned int*)(0x42706288UL))
#define bFM4_MFS3_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4270628CUL))
#define bFM4_MFS3_UART_FCR0_FSET               *((volatile unsigned int*)(0x42706290UL))
#define bFM4_MFS3_UART_FCR0_FLD                *((volatile unsigned int*)(0x42706294UL))
#define bFM4_MFS3_UART_FCR0_FLST               *((volatile unsigned int*)(0x42706298UL))
#define bFM4_MFS3_UART_FCR1_FSEL               *((volatile unsigned int*)(0x427062A0UL))
#define bFM4_MFS3_UART_FCR1_FTIE               *((volatile unsigned int*)(0x427062A4UL))
#define bFM4_MFS3_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x427062A8UL))
#define bFM4_MFS3_UART_FCR1_FRIIE              *((volatile unsigned int*)(0x427062ACUL))
#define bFM4_MFS3_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x427062B0UL))
#define bFM4_MFS3_UART_FBYTE_FD0               *((volatile unsigned int*)(0x42706300UL))
#define bFM4_MFS3_UART_FBYTE_FD1               *((volatile unsigned int*)(0x42706304UL))
#define bFM4_MFS3_UART_FBYTE_FD2               *((volatile unsigned int*)(0x42706308UL))
#define bFM4_MFS3_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4270630CUL))
#define bFM4_MFS3_UART_FBYTE_FD4               *((volatile unsigned int*)(0x42706310UL))
#define bFM4_MFS3_UART_FBYTE_FD5               *((volatile unsigned int*)(0x42706314UL))
#define bFM4_MFS3_UART_FBYTE_FD6               *((volatile unsigned int*)(0x42706318UL))
#define bFM4_MFS3_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4270631CUL))
#define bFM4_MFS3_UART_FBYTE_FD8               *((volatile unsigned int*)(0x42706320UL))
#define bFM4_MFS3_UART_FBYTE_FD9               *((volatile unsigned int*)(0x42706324UL))
#define bFM4_MFS3_UART_FBYTE_FD10              *((volatile unsigned int*)(0x42706328UL))
#define bFM4_MFS3_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4270632CUL))
#define bFM4_MFS3_UART_FBYTE_FD12              *((volatile unsigned int*)(0x42706330UL))
#define bFM4_MFS3_UART_FBYTE_FD13              *((volatile unsigned int*)(0x42706334UL))
#define bFM4_MFS3_UART_FBYTE_FD14              *((volatile unsigned int*)(0x42706338UL))
#define bFM4_MFS3_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4270633CUL))
#define bFM4_MFS3_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x42706300UL))
#define bFM4_MFS3_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x42706304UL))
#define bFM4_MFS3_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x42706308UL))
#define bFM4_MFS3_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4270630CUL))
#define bFM4_MFS3_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x42706310UL))
#define bFM4_MFS3_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x42706314UL))
#define bFM4_MFS3_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x42706318UL))
#define bFM4_MFS3_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4270631CUL))
#define bFM4_MFS3_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x42706320UL))
#define bFM4_MFS3_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x42706324UL))
#define bFM4_MFS3_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x42706328UL))
#define bFM4_MFS3_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4270632CUL))
#define bFM4_MFS3_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x42706330UL))
#define bFM4_MFS3_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x42706334UL))
#define bFM4_MFS3_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x42706338UL))
#define bFM4_MFS3_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4270633CUL))

