snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS CSIO channel 3 registers */
#define bFM4_MFS3_CSIO_SMR_SOE                 *((volatile unsigned int*)(0x42706000UL))
#define bFM4_MFS3_CSIO_SMR_SCKE                *((volatile unsigned int*)(0x42706004UL))
#define bFM4_MFS3_CSIO_SMR_BDS                 *((volatile unsigned int*)(0x42706008UL))
#define bFM4_MFS3_CSIO_SMR_SCINV               *((volatile unsigned int*)(0x4270600CUL))
#define bFM4_MFS3_CSIO_SMR_MD0                 *((volatile unsigned int*)(0x42706014UL))
#define bFM4_MFS3_CSIO_SMR_MD1                 *((volatile unsigned int*)(0x42706018UL))
#define bFM4_MFS3_CSIO_SMR_MD2                 *((volatile unsigned int*)(0x4270601CUL))
#define bFM4_MFS3_CSIO_SCR_TXE                 *((volatile unsigned int*)(0x42706020UL))
#define bFM4_MFS3_CSIO_SCR_RXE                 *((volatile unsigned int*)(0x42706024UL))
#define bFM4_MFS3_CSIO_SCR_TBIE                *((volatile unsigned int*)(0x42706028UL))
#define bFM4_MFS3_CSIO_SCR_TIE                 *((volatile unsigned int*)(0x4270602CUL))
#define bFM4_MFS3_CSIO_SCR_RIE                 *((volatile unsigned int*)(0x42706030UL))
#define bFM4_MFS3_CSIO_SCR_SPI                 *((volatile unsigned int*)(0x42706034UL))
#define bFM4_MFS3_CSIO_SCR_MS                  *((volatile unsigned int*)(0x42706038UL))
#define bFM4_MFS3_CSIO_SCR_UPCL                *((volatile unsigned int*)(0x4270603CUL))
#define bFM4_MFS3_CSIO_ESCR_L0                 *((volatile unsigned int*)(0x42706080UL))
#define bFM4_MFS3_CSIO_ESCR_L1                 *((volatile unsigned int*)(0x42706084UL))
#define bFM4_MFS3_CSIO_ESCR_L2                 *((volatile unsigned int*)(0x42706088UL))
#define bFM4_MFS3_CSIO_ESCR_WT0                *((volatile unsigned int*)(0x4270608CUL))
#define bFM4_MFS3_CSIO_ESCR_WT1                *((volatile unsigned int*)(0x42706090UL))
#define bFM4_MFS3_CSIO_ESCR_L3                 *((volatile unsigned int*)(0x42706098UL))
#define bFM4_MFS3_CSIO_ESCR_SOP                *((volatile unsigned int*)(0x4270609CUL))
#define bFM4_MFS3_CSIO_SSR_TBI                 *((volatile unsigned int*)(0x427060A0UL))
#define bFM4_MFS3_CSIO_SSR_TDRE                *((volatile unsigned int*)(0x427060A4UL))
#define bFM4_MFS3_CSIO_SSR_RDRF                *((volatile unsigned int*)(0x427060A8UL))
#define bFM4_MFS3_CSIO_SSR_ORE                 *((volatile unsigned int*)(0x427060ACUL))
#define bFM4_MFS3_CSIO_SSR_AWC                 *((volatile unsigned int*)(0x427060B0UL))
#define bFM4_MFS3_CSIO_SSR_REC                 *((volatile unsigned int*)(0x427060BCUL))
#define bFM4_MFS3_CSIO_FCR_FE1                 *((volatile unsigned int*)(0x42706280UL))
#define bFM4_MFS3_CSIO_FCR_FE2                 *((volatile unsigned int*)(0x42706284UL))
#define bFM4_MFS3_CSIO_FCR_FCL1                *((volatile unsigned int*)(0x42706288UL))
#define bFM4_MFS3_CSIO_FCR_FCL2                *((volatile unsigned int*)(0x4270628CUL))
#define bFM4_MFS3_CSIO_FCR_FSET                *((volatile unsigned int*)(0x42706290UL))
#define bFM4_MFS3_CSIO_FCR_FLD                 *((volatile unsigned int*)(0x42706294UL))
#define bFM4_MFS3_CSIO_FCR_FLST                *((volatile unsigned int*)(0x42706298UL))
#define bFM4_MFS3_CSIO_FCR_FSEL                *((volatile unsigned int*)(0x427062A0UL))
#define bFM4_MFS3_CSIO_FCR_FTIE                *((volatile unsigned int*)(0x427062A4UL))
#define bFM4_MFS3_CSIO_FCR_FDRQ                *((volatile unsigned int*)(0x427062A8UL))
#define bFM4_MFS3_CSIO_FCR_FRIIE               *((volatile unsigned int*)(0x427062ACUL))
#define bFM4_MFS3_CSIO_FCR_FLSTE               *((volatile unsigned int*)(0x427062B0UL))
#define bFM4_MFS3_CSIO_FCR0_FE1                *((volatile unsigned int*)(0x42706280UL))
#define bFM4_MFS3_CSIO_FCR0_FE2                *((volatile unsigned int*)(0x42706284UL))
#define bFM4_MFS3_CSIO_FCR0_FCL1               *((volatile unsigned int*)(0x42706288UL))
#define bFM4_MFS3_CSIO_FCR0_FCL2               *((volatile unsigned int*)(0x4270628CUL))
#define bFM4_MFS3_CSIO_FCR0_FSET               *((volatile unsigned int*)(0x42706290UL))
#define bFM4_MFS3_CSIO_FCR0_FLD                *((volatile unsigned int*)(0x42706294UL))
#define bFM4_MFS3_CSIO_FCR0_FLST               *((volatile unsigned int*)(0x42706298UL))
#define bFM4_MFS3_CSIO_FCR1_FSEL               *((volatile unsigned int*)(0x427062A0UL))
#define bFM4_MFS3_CSIO_FCR1_FTIE               *((volatile unsigned int*)(0x427062A4UL))
#define bFM4_MFS3_CSIO_FCR1_FDRQ               *((volatile unsigned int*)(0x427062A8UL))
#define bFM4_MFS3_CSIO_FCR1_FRIIE              *((volatile unsigned int*)(0x427062ACUL))
#define bFM4_MFS3_CSIO_FCR1_FLSTE              *((volatile unsigned int*)(0x427062B0UL))
#define bFM4_MFS3_CSIO_FBYTE_FD0               *((volatile unsigned int*)(0x42706300UL))
#define bFM4_MFS3_CSIO_FBYTE_FD1               *((volatile unsigned int*)(0x42706304UL))
#define bFM4_MFS3_CSIO_FBYTE_FD2               *((volatile unsigned int*)(0x42706308UL))
#define bFM4_MFS3_CSIO_FBYTE_FD3               *((volatile unsigned int*)(0x4270630CUL))
#define bFM4_MFS3_CSIO_FBYTE_FD4               *((volatile unsigned int*)(0x42706310UL))
#define bFM4_MFS3_CSIO_FBYTE_FD5               *((volatile unsigned int*)(0x42706314UL))
#define bFM4_MFS3_CSIO_FBYTE_FD6               *((volatile unsigned int*)(0x42706318UL))
#define bFM4_MFS3_CSIO_FBYTE_FD7               *((volatile unsigned int*)(0x4270631CUL))
#define bFM4_MFS3_CSIO_FBYTE_FD8               *((volatile unsigned int*)(0x42706320UL))
#define bFM4_MFS3_CSIO_FBYTE_FD9               *((volatile unsigned int*)(0x42706324UL))
#define bFM4_MFS3_CSIO_FBYTE_FD10              *((volatile unsigned int*)(0x42706328UL))
#define bFM4_MFS3_CSIO_FBYTE_FD11              *((volatile unsigned int*)(0x4270632CUL))
#define bFM4_MFS3_CSIO_FBYTE_FD12              *((volatile unsigned int*)(0x42706330UL))
#define bFM4_MFS3_CSIO_FBYTE_FD13              *((volatile unsigned int*)(0x42706334UL))
#define bFM4_MFS3_CSIO_FBYTE_FD14              *((volatile unsigned int*)(0x42706338UL))
#define bFM4_MFS3_CSIO_FBYTE_FD15              *((volatile unsigned int*)(0x4270633CUL))
#define bFM4_MFS3_CSIO_FBYTE1_FD0              *((volatile unsigned int*)(0x42706300UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD1              *((volatile unsigned int*)(0x42706304UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD2              *((volatile unsigned int*)(0x42706308UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD3              *((volatile unsigned int*)(0x4270630CUL))
#define bFM4_MFS3_CSIO_FBYTE1_FD4              *((volatile unsigned int*)(0x42706310UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD5              *((volatile unsigned int*)(0x42706314UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD6              *((volatile unsigned int*)(0x42706318UL))
#define bFM4_MFS3_CSIO_FBYTE1_FD7              *((volatile unsigned int*)(0x4270631CUL))
#define bFM4_MFS3_CSIO_FBYTE2_FD8              *((volatile unsigned int*)(0x42706320UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD9              *((volatile unsigned int*)(0x42706324UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD10             *((volatile unsigned int*)(0x42706328UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD11             *((volatile unsigned int*)(0x4270632CUL))
#define bFM4_MFS3_CSIO_FBYTE2_FD12             *((volatile unsigned int*)(0x42706330UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD13             *((volatile unsigned int*)(0x42706334UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD14             *((volatile unsigned int*)(0x42706338UL))
#define bFM4_MFS3_CSIO_FBYTE2_FD15             *((volatile unsigned int*)(0x4270633CUL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD0           *((volatile unsigned int*)(0x42706380UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD1           *((volatile unsigned int*)(0x42706384UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD2           *((volatile unsigned int*)(0x42706388UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD3           *((volatile unsigned int*)(0x4270638CUL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD4           *((volatile unsigned int*)(0x42706390UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD5           *((volatile unsigned int*)(0x42706394UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD6           *((volatile unsigned int*)(0x42706398UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSHD7           *((volatile unsigned int*)(0x4270639CUL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU0           *((volatile unsigned int*)(0x427063A0UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU1           *((volatile unsigned int*)(0x427063A4UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU2           *((volatile unsigned int*)(0x427063A8UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU3           *((volatile unsigned int*)(0x427063ACUL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU4           *((volatile unsigned int*)(0x427063B0UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU5           *((volatile unsigned int*)(0x427063B4UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU6           *((volatile unsigned int*)(0x427063B8UL))
#define bFM4_MFS3_CSIO_SCSTR10_CSSU7           *((volatile unsigned int*)(0x427063BCUL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS0           *((volatile unsigned int*)(0x42706400UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS1           *((volatile unsigned int*)(0x42706404UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS2           *((volatile unsigned int*)(0x42706408UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS3           *((volatile unsigned int*)(0x4270640CUL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS4           *((volatile unsigned int*)(0x42706410UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS5           *((volatile unsigned int*)(0x42706414UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS6           *((volatile unsigned int*)(0x42706418UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS7           *((volatile unsigned int*)(0x4270641CUL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS8           *((volatile unsigned int*)(0x42706420UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS9           *((volatile unsigned int*)(0x42706424UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS10          *((volatile unsigned int*)(0x42706428UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS11          *((volatile unsigned int*)(0x4270642CUL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS12          *((volatile unsigned int*)(0x42706430UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS13          *((volatile unsigned int*)(0x42706434UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS14          *((volatile unsigned int*)(0x42706438UL))
#define bFM4_MFS3_CSIO_SCSTR32_CSDS15          *((volatile unsigned int*)(0x4270643CUL))
#define bFM4_MFS3_CSIO_SACSR_TMRE              *((volatile unsigned int*)(0x42706480UL))
#define bFM4_MFS3_CSIO_SACSR_TDIV0             *((volatile unsigned int*)(0x42706484UL))
#define bFM4_MFS3_CSIO_SACSR_TDIV1             *((volatile unsigned int*)(0x42706488UL))
#define bFM4_MFS3_CSIO_SACSR_TDIV2             *((volatile unsigned int*)(0x4270648CUL))
#define bFM4_MFS3_CSIO_SACSR_TDIV3             *((volatile unsigned int*)(0x42706490UL))
#define bFM4_MFS3_CSIO_SACSR_TSYNE             *((volatile unsigned int*)(0x42706498UL))
#define bFM4_MFS3_CSIO_SACSR_TINTE             *((volatile unsigned int*)(0x4270649CUL))
#define bFM4_MFS3_CSIO_SACSR_TINT              *((volatile unsigned int*)(0x427064A0UL))
#define bFM4_MFS3_CSIO_SACSR_CSE               *((volatile unsigned int*)(0x427064ACUL))
#define bFM4_MFS3_CSIO_SACSR_CSEIE             *((volatile unsigned int*)(0x427064B0UL))
#define bFM4_MFS3_CSIO_SACSR_TBEEN             *((volatile unsigned int*)(0x427064B4UL))
#define bFM4_MFS3_CSIO_STMR_TM0                *((volatile unsigned int*)(0x42706500UL))
#define bFM4_MFS3_CSIO_STMR_TM1                *((volatile unsigned int*)(0x42706504UL))
#define bFM4_MFS3_CSIO_STMR_TM2                *((volatile unsigned int*)(0x42706508UL))
#define bFM4_MFS3_CSIO_STMR_TM3                *((volatile unsigned int*)(0x4270650CUL))
#define bFM4_MFS3_CSIO_STMR_TM4                *((volatile unsigned int*)(0x42706510UL))
#define bFM4_MFS3_CSIO_STMR_TM5                *((volatile unsigned int*)(0x42706514UL))
#define bFM4_MFS3_CSIO_STMR_TM6                *((volatile unsigned int*)(0x42706518UL))
#define bFM4_MFS3_CSIO_STMR_TM7                *((volatile unsigned int*)(0x4270651CUL))
#define bFM4_MFS3_CSIO_STMR_TM8                *((volatile unsigned int*)(0x42706520UL))
#define bFM4_MFS3_CSIO_STMR_TM9                *((volatile unsigned int*)(0x42706524UL))
#define bFM4_MFS3_CSIO_STMR_TM10               *((volatile unsigned int*)(0x42706528UL))
#define bFM4_MFS3_CSIO_STMR_TM11               *((volatile unsigned int*)(0x4270652CUL))
#define bFM4_MFS3_CSIO_STMR_TM12               *((volatile unsigned int*)(0x42706530UL))
#define bFM4_MFS3_CSIO_STMR_TM13               *((volatile unsigned int*)(0x42706534UL))
#define bFM4_MFS3_CSIO_STMR_TM14               *((volatile unsigned int*)(0x42706538UL))
#define bFM4_MFS3_CSIO_STMR_TM15               *((volatile unsigned int*)(0x4270653CUL))
#define bFM4_MFS3_CSIO_STMCR_TC0               *((volatile unsigned int*)(0x42706580UL))
#define bFM4_MFS3_CSIO_STMCR_TC1               *((volatile unsigned int*)(0x42706584UL))
#define bFM4_MFS3_CSIO_STMCR_TC2               *((volatile unsigned int*)(0x42706588UL))
#define bFM4_MFS3_CSIO_STMCR_TC3               *((volatile unsigned int*)(0x4270658CUL))
#define bFM4_MFS3_CSIO_STMCR_TC4               *((volatile unsigned int*)(0x42706590UL))
#define bFM4_MFS3_CSIO_STMCR_TC5               *((volatile unsigned int*)(0x42706594UL))
#define bFM4_MFS3_CSIO_STMCR_TC6               *((volatile unsigned int*)(0x42706598UL))
#define bFM4_MFS3_CSIO_STMCR_TC7               *((volatile unsigned int*)(0x4270659CUL))
#define bFM4_MFS3_CSIO_STMCR_TC8               *((volatile unsigned int*)(0x427065A0UL))
#define bFM4_MFS3_CSIO_STMCR_TC9               *((volatile unsigned int*)(0x427065A4UL))
#define bFM4_MFS3_CSIO_STMCR_TC10              *((volatile unsigned int*)(0x427065A8UL))
#define bFM4_MFS3_CSIO_STMCR_TC11              *((volatile unsigned int*)(0x427065ACUL))
#define bFM4_MFS3_CSIO_STMCR_TC12              *((volatile unsigned int*)(0x427065B0UL))
#define bFM4_MFS3_CSIO_STMCR_TC13              *((volatile unsigned int*)(0x427065B4UL))
#define bFM4_MFS3_CSIO_STMCR_TC14              *((volatile unsigned int*)(0x427065B8UL))
#define bFM4_MFS3_CSIO_STMCR_TC15              *((volatile unsigned int*)(0x427065BCUL))
#define bFM4_MFS3_CSIO_SCSCR_CSOE              *((volatile unsigned int*)(0x42706600UL))
#define bFM4_MFS3_CSIO_SCSCR_CSEN0             *((volatile unsigned int*)(0x42706604UL))
#define bFM4_MFS3_CSIO_SCSCR_CSLVL             *((volatile unsigned int*)(0x42706614UL))
#define bFM4_MFS3_CSIO_SCSCR_CDIV0             *((volatile unsigned int*)(0x42706618UL))
#define bFM4_MFS3_CSIO_SCSCR_CDIV1             *((volatile unsigned int*)(0x4270661CUL))
#define bFM4_MFS3_CSIO_SCSCR_CDIV2             *((volatile unsigned int*)(0x42706620UL))
#define bFM4_MFS3_CSIO_SCSCR_SCAM              *((volatile unsigned int*)(0x42706624UL))

