snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS CSIO channel 9 registers */
#define bFM4_MFS9_CSIO_SMR_SOE                 *((volatile unsigned int*)(0x42712000UL))
#define bFM4_MFS9_CSIO_SMR_SCKE                *((volatile unsigned int*)(0x42712004UL))
#define bFM4_MFS9_CSIO_SMR_BDS                 *((volatile unsigned int*)(0x42712008UL))
#define bFM4_MFS9_CSIO_SMR_SCINV               *((volatile unsigned int*)(0x4271200CUL))
#define bFM4_MFS9_CSIO_SMR_MD0                 *((volatile unsigned int*)(0x42712014UL))
#define bFM4_MFS9_CSIO_SMR_MD1                 *((volatile unsigned int*)(0x42712018UL))
#define bFM4_MFS9_CSIO_SMR_MD2                 *((volatile unsigned int*)(0x4271201CUL))
#define bFM4_MFS9_CSIO_SCR_TXE                 *((volatile unsigned int*)(0x42712020UL))
#define bFM4_MFS9_CSIO_SCR_RXE                 *((volatile unsigned int*)(0x42712024UL))
#define bFM4_MFS9_CSIO_SCR_TBIE                *((volatile unsigned int*)(0x42712028UL))
#define bFM4_MFS9_CSIO_SCR_TIE                 *((volatile unsigned int*)(0x4271202CUL))
#define bFM4_MFS9_CSIO_SCR_RIE                 *((volatile unsigned int*)(0x42712030UL))
#define bFM4_MFS9_CSIO_SCR_SPI                 *((volatile unsigned int*)(0x42712034UL))
#define bFM4_MFS9_CSIO_SCR_MS                  *((volatile unsigned int*)(0x42712038UL))
#define bFM4_MFS9_CSIO_SCR_UPCL                *((volatile unsigned int*)(0x4271203CUL))
#define bFM4_MFS9_CSIO_ESCR_L0                 *((volatile unsigned int*)(0x42712080UL))
#define bFM4_MFS9_CSIO_ESCR_L1                 *((volatile unsigned int*)(0x42712084UL))
#define bFM4_MFS9_CSIO_ESCR_L2                 *((volatile unsigned int*)(0x42712088UL))
#define bFM4_MFS9_CSIO_ESCR_WT0                *((volatile unsigned int*)(0x4271208CUL))
#define bFM4_MFS9_CSIO_ESCR_WT1                *((volatile unsigned int*)(0x42712090UL))
#define bFM4_MFS9_CSIO_ESCR_L3                 *((volatile unsigned int*)(0x42712098UL))
#define bFM4_MFS9_CSIO_ESCR_SOP                *((volatile unsigned int*)(0x4271209CUL))
#define bFM4_MFS9_CSIO_SSR_TBI                 *((volatile unsigned int*)(0x427120A0UL))
#define bFM4_MFS9_CSIO_SSR_TDRE                *((volatile unsigned int*)(0x427120A4UL))
#define bFM4_MFS9_CSIO_SSR_RDRF                *((volatile unsigned int*)(0x427120A8UL))
#define bFM4_MFS9_CSIO_SSR_ORE                 *((volatile unsigned int*)(0x427120ACUL))
#define bFM4_MFS9_CSIO_SSR_AWC                 *((volatile unsigned int*)(0x427120B0UL))
#define bFM4_MFS9_CSIO_SSR_REC                 *((volatile unsigned int*)(0x427120BCUL))
#define bFM4_MFS9_CSIO_FCR_FE1                 *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_CSIO_FCR_FE2                 *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_CSIO_FCR_FCL1                *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_CSIO_FCR_FCL2                *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_CSIO_FCR_FSET                *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_CSIO_FCR_FLD                 *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_CSIO_FCR_FLST                *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_CSIO_FCR_FSEL                *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_CSIO_FCR_FTIE                *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_CSIO_FCR_FDRQ                *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_CSIO_FCR_FRIIE               *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_CSIO_FCR_FLSTE               *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_CSIO_FCR0_FE1                *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_CSIO_FCR0_FE2                *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_CSIO_FCR0_FCL1               *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_CSIO_FCR0_FCL2               *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_CSIO_FCR0_FSET               *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_CSIO_FCR0_FLD                *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_CSIO_FCR0_FLST               *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_CSIO_FCR1_FSEL               *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_CSIO_FCR1_FTIE               *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_CSIO_FCR1_FDRQ               *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_CSIO_FCR1_FRIIE              *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_CSIO_FCR1_FLSTE              *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_CSIO_FBYTE_FD0               *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_CSIO_FBYTE_FD1               *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_CSIO_FBYTE_FD2               *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_CSIO_FBYTE_FD3               *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_CSIO_FBYTE_FD4               *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_CSIO_FBYTE_FD5               *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_CSIO_FBYTE_FD6               *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_CSIO_FBYTE_FD7               *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_CSIO_FBYTE_FD8               *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_CSIO_FBYTE_FD9               *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_CSIO_FBYTE_FD10              *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_CSIO_FBYTE_FD11              *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_CSIO_FBYTE_FD12              *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_CSIO_FBYTE_FD13              *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_CSIO_FBYTE_FD14              *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_CSIO_FBYTE_FD15              *((volatile unsigned int*)(0x4271233CUL))
#define bFM4_MFS9_CSIO_FBYTE1_FD0              *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD1              *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD2              *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD3              *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_CSIO_FBYTE1_FD4              *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD5              *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD6              *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_CSIO_FBYTE1_FD7              *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_CSIO_FBYTE2_FD8              *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD9              *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD10             *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD11             *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_CSIO_FBYTE2_FD12             *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD13             *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD14             *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_CSIO_FBYTE2_FD15             *((volatile unsigned int*)(0x4271233CUL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD0           *((volatile unsigned int*)(0x42712380UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD1           *((volatile unsigned int*)(0x42712384UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD2           *((volatile unsigned int*)(0x42712388UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD3           *((volatile unsigned int*)(0x4271238CUL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD4           *((volatile unsigned int*)(0x42712390UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD5           *((volatile unsigned int*)(0x42712394UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD6           *((volatile unsigned int*)(0x42712398UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSHD7           *((volatile unsigned int*)(0x4271239CUL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU0           *((volatile unsigned int*)(0x427123A0UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU1           *((volatile unsigned int*)(0x427123A4UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU2           *((volatile unsigned int*)(0x427123A8UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU3           *((volatile unsigned int*)(0x427123ACUL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU4           *((volatile unsigned int*)(0x427123B0UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU5           *((volatile unsigned int*)(0x427123B4UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU6           *((volatile unsigned int*)(0x427123B8UL))
#define bFM4_MFS9_CSIO_SCSTR10_CSSU7           *((volatile unsigned int*)(0x427123BCUL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS0           *((volatile unsigned int*)(0x42712400UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS1           *((volatile unsigned int*)(0x42712404UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS2           *((volatile unsigned int*)(0x42712408UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS3           *((volatile unsigned int*)(0x4271240CUL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS4           *((volatile unsigned int*)(0x42712410UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS5           *((volatile unsigned int*)(0x42712414UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS6           *((volatile unsigned int*)(0x42712418UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS7           *((volatile unsigned int*)(0x4271241CUL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS8           *((volatile unsigned int*)(0x42712420UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS9           *((volatile unsigned int*)(0x42712424UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS10          *((volatile unsigned int*)(0x42712428UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS11          *((volatile unsigned int*)(0x4271242CUL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS12          *((volatile unsigned int*)(0x42712430UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS13          *((volatile unsigned int*)(0x42712434UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS14          *((volatile unsigned int*)(0x42712438UL))
#define bFM4_MFS9_CSIO_SCSTR32_CSDS15          *((volatile unsigned int*)(0x4271243CUL))
#define bFM4_MFS9_CSIO_SACSR_TMRE              *((volatile unsigned int*)(0x42712480UL))
#define bFM4_MFS9_CSIO_SACSR_TDIV0             *((volatile unsigned int*)(0x42712484UL))
#define bFM4_MFS9_CSIO_SACSR_TDIV1             *((volatile unsigned int*)(0x42712488UL))
#define bFM4_MFS9_CSIO_SACSR_TDIV2             *((volatile unsigned int*)(0x4271248CUL))
#define bFM4_MFS9_CSIO_SACSR_TDIV3             *((volatile unsigned int*)(0x42712490UL))
#define bFM4_MFS9_CSIO_SACSR_TSYNE             *((volatile unsigned int*)(0x42712498UL))
#define bFM4_MFS9_CSIO_SACSR_TINTE             *((volatile unsigned int*)(0x4271249CUL))
#define bFM4_MFS9_CSIO_SACSR_TINT              *((volatile unsigned int*)(0x427124A0UL))
#define bFM4_MFS9_CSIO_SACSR_CSE               *((volatile unsigned int*)(0x427124ACUL))
#define bFM4_MFS9_CSIO_SACSR_CSEIE             *((volatile unsigned int*)(0x427124B0UL))
#define bFM4_MFS9_CSIO_SACSR_TBEEN             *((volatile unsigned int*)(0x427124B4UL))
#define bFM4_MFS9_CSIO_STMR_TM0                *((volatile unsigned int*)(0x42712500UL))
#define bFM4_MFS9_CSIO_STMR_TM1                *((volatile unsigned int*)(0x42712504UL))
#define bFM4_MFS9_CSIO_STMR_TM2                *((volatile unsigned int*)(0x42712508UL))
#define bFM4_MFS9_CSIO_STMR_TM3                *((volatile unsigned int*)(0x4271250CUL))
#define bFM4_MFS9_CSIO_STMR_TM4                *((volatile unsigned int*)(0x42712510UL))
#define bFM4_MFS9_CSIO_STMR_TM5                *((volatile unsigned int*)(0x42712514UL))
#define bFM4_MFS9_CSIO_STMR_TM6                *((volatile unsigned int*)(0x42712518UL))
#define bFM4_MFS9_CSIO_STMR_TM7                *((volatile unsigned int*)(0x4271251CUL))
#define bFM4_MFS9_CSIO_STMR_TM8                *((volatile unsigned int*)(0x42712520UL))
#define bFM4_MFS9_CSIO_STMR_TM9                *((volatile unsigned int*)(0x42712524UL))
#define bFM4_MFS9_CSIO_STMR_TM10               *((volatile unsigned int*)(0x42712528UL))
#define bFM4_MFS9_CSIO_STMR_TM11               *((volatile unsigned int*)(0x4271252CUL))
#define bFM4_MFS9_CSIO_STMR_TM12               *((volatile unsigned int*)(0x42712530UL))
#define bFM4_MFS9_CSIO_STMR_TM13               *((volatile unsigned int*)(0x42712534UL))
#define bFM4_MFS9_CSIO_STMR_TM14               *((volatile unsigned int*)(0x42712538UL))
#define bFM4_MFS9_CSIO_STMR_TM15               *((volatile unsigned int*)(0x4271253CUL))
#define bFM4_MFS9_CSIO_STMCR_TC0               *((volatile unsigned int*)(0x42712580UL))
#define bFM4_MFS9_CSIO_STMCR_TC1               *((volatile unsigned int*)(0x42712584UL))
#define bFM4_MFS9_CSIO_STMCR_TC2               *((volatile unsigned int*)(0x42712588UL))
#define bFM4_MFS9_CSIO_STMCR_TC3               *((volatile unsigned int*)(0x4271258CUL))
#define bFM4_MFS9_CSIO_STMCR_TC4               *((volatile unsigned int*)(0x42712590UL))
#define bFM4_MFS9_CSIO_STMCR_TC5               *((volatile unsigned int*)(0x42712594UL))
#define bFM4_MFS9_CSIO_STMCR_TC6               *((volatile unsigned int*)(0x42712598UL))
#define bFM4_MFS9_CSIO_STMCR_TC7               *((volatile unsigned int*)(0x4271259CUL))
#define bFM4_MFS9_CSIO_STMCR_TC8               *((volatile unsigned int*)(0x427125A0UL))
#define bFM4_MFS9_CSIO_STMCR_TC9               *((volatile unsigned int*)(0x427125A4UL))
#define bFM4_MFS9_CSIO_STMCR_TC10              *((volatile unsigned int*)(0x427125A8UL))
#define bFM4_MFS9_CSIO_STMCR_TC11              *((volatile unsigned int*)(0x427125ACUL))
#define bFM4_MFS9_CSIO_STMCR_TC12              *((volatile unsigned int*)(0x427125B0UL))
#define bFM4_MFS9_CSIO_STMCR_TC13              *((volatile unsigned int*)(0x427125B4UL))
#define bFM4_MFS9_CSIO_STMCR_TC14              *((volatile unsigned int*)(0x427125B8UL))
#define bFM4_MFS9_CSIO_STMCR_TC15              *((volatile unsigned int*)(0x427125BCUL))
#define bFM4_MFS9_CSIO_SCSCR_CSOE              *((volatile unsigned int*)(0x42712600UL))
#define bFM4_MFS9_CSIO_SCSCR_CSEN0             *((volatile unsigned int*)(0x42712604UL))
#define bFM4_MFS9_CSIO_SCSCR_CSLVL             *((volatile unsigned int*)(0x42712614UL))
#define bFM4_MFS9_CSIO_SCSCR_CDIV0             *((volatile unsigned int*)(0x42712618UL))
#define bFM4_MFS9_CSIO_SCSCR_CDIV1             *((volatile unsigned int*)(0x4271261CUL))
#define bFM4_MFS9_CSIO_SCSCR_CDIV2             *((volatile unsigned int*)(0x42712620UL))
#define bFM4_MFS9_CSIO_SCSCR_SCAM              *((volatile unsigned int*)(0x42712624UL))

/* MFS LIN channel 9 registers */
#define bFM4_MFS9_LIN_SMR_SOE                  *((volatile unsigned int*)(0x42712000UL))
#define bFM4_MFS9_LIN_SMR_SBL                  *((volatile unsigned int*)(0x4271200CUL))
#define bFM4_MFS9_LIN_SMR_WUCR                 *((volatile unsigned int*)(0x42712010UL))
#define bFM4_MFS9_LIN_SMR_MD0                  *((volatile unsigned int*)(0x42712014UL))
#define bFM4_MFS9_LIN_SMR_MD1                  *((volatile unsigned int*)(0x42712018UL))
#define bFM4_MFS9_LIN_SMR_MD2                  *((volatile unsigned int*)(0x4271201CUL))
#define bFM4_MFS9_LIN_SCR_TXE                  *((volatile unsigned int*)(0x42712020UL))
#define bFM4_MFS9_LIN_SCR_RXE                  *((volatile unsigned int*)(0x42712024UL))
#define bFM4_MFS9_LIN_SCR_TBIE                 *((volatile unsigned int*)(0x42712028UL))
#define bFM4_MFS9_LIN_SCR_TIE                  *((volatile unsigned int*)(0x4271202CUL))
#define bFM4_MFS9_LIN_SCR_RIE                  *((volatile unsigned int*)(0x42712030UL))
#define bFM4_MFS9_LIN_SCR_LBR                  *((volatile unsigned int*)(0x42712034UL))
#define bFM4_MFS9_LIN_SCR_MS                   *((volatile unsigned int*)(0x42712038UL))
#define bFM4_MFS9_LIN_SCR_UPCL                 *((volatile unsigned int*)(0x4271203CUL))
#define bFM4_MFS9_LIN_ESCR_DEL0                *((volatile unsigned int*)(0x42712080UL))
#define bFM4_MFS9_LIN_ESCR_DEL1                *((volatile unsigned int*)(0x42712084UL))
#define bFM4_MFS9_LIN_ESCR_LBL0                *((volatile unsigned int*)(0x42712088UL))
#define bFM4_MFS9_LIN_ESCR_LBL1                *((volatile unsigned int*)(0x4271208CUL))
#define bFM4_MFS9_LIN_ESCR_LBIE                *((volatile unsigned int*)(0x42712090UL))
#define bFM4_MFS9_LIN_ESCR_ESBL                *((volatile unsigned int*)(0x42712098UL))
#define bFM4_MFS9_LIN_SSR_TBI                  *((volatile unsigned int*)(0x427120A0UL))
#define bFM4_MFS9_LIN_SSR_TDRE                 *((volatile unsigned int*)(0x427120A4UL))
#define bFM4_MFS9_LIN_SSR_RDRF                 *((volatile unsigned int*)(0x427120A8UL))
#define bFM4_MFS9_LIN_SSR_ORE                  *((volatile unsigned int*)(0x427120ACUL))
#define bFM4_MFS9_LIN_SSR_FRE                  *((volatile unsigned int*)(0x427120B0UL))
#define bFM4_MFS9_LIN_SSR_LBD                  *((volatile unsigned int*)(0x427120B4UL))
#define bFM4_MFS9_LIN_SSR_REC                  *((volatile unsigned int*)(0x427120BCUL))
#define bFM4_MFS9_LIN_BGR_EXT                  *((volatile unsigned int*)(0x427121BCUL))
#define bFM4_MFS9_LIN_BGR1_EXT                 *((volatile unsigned int*)(0x427121BCUL))
#define bFM4_MFS9_LIN_FCR_FE1                  *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_LIN_FCR_FE2                  *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_LIN_FCR_FCL1                 *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_LIN_FCR_FCL2                 *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_LIN_FCR_FSET                 *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_LIN_FCR_FLD                  *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_LIN_FCR_FLST                 *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_LIN_FCR_FSEL                 *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_LIN_FCR_FTIE                 *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_LIN_FCR_FDRQ                 *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_LIN_FCR_FRIIE                *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_LIN_FCR_FLSTE                *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_LIN_FCR0_FE1                 *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_LIN_FCR0_FE2                 *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_LIN_FCR0_FCL1                *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_LIN_FCR0_FCL2                *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_LIN_FCR0_FSET                *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_LIN_FCR0_FLD                 *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_LIN_FCR0_FLST                *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_LIN_FCR1_FSEL                *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_LIN_FCR1_FTIE                *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_LIN_FCR1_FDRQ                *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_LIN_FCR1_FRIIE               *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_LIN_FCR1_FLSTE               *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_LIN_FBYTE_FD0                *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_LIN_FBYTE_FD1                *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_LIN_FBYTE_FD2                *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_LIN_FBYTE_FD3                *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_LIN_FBYTE_FD4                *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_LIN_FBYTE_FD5                *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_LIN_FBYTE_FD6                *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_LIN_FBYTE_FD7                *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_LIN_FBYTE_FD8                *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_LIN_FBYTE_FD9                *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_LIN_FBYTE_FD10               *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_LIN_FBYTE_FD11               *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_LIN_FBYTE_FD12               *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_LIN_FBYTE_FD13               *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_LIN_FBYTE_FD14               *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_LIN_FBYTE_FD15               *((volatile unsigned int*)(0x4271233CUL))
#define bFM4_MFS9_LIN_FBYTE1_FD0               *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_LIN_FBYTE1_FD1               *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_LIN_FBYTE1_FD2               *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_LIN_FBYTE1_FD3               *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_LIN_FBYTE1_FD4               *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_LIN_FBYTE1_FD5               *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_LIN_FBYTE1_FD6               *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_LIN_FBYTE1_FD7               *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_LIN_FBYTE2_FD8               *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_LIN_FBYTE2_FD9               *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_LIN_FBYTE2_FD10              *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_LIN_FBYTE2_FD11              *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_LIN_FBYTE2_FD12              *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_LIN_FBYTE2_FD13              *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_LIN_FBYTE2_FD14              *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_LIN_FBYTE2_FD15              *((volatile unsigned int*)(0x4271233CUL))

