snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS LIN channel 12 registers */
#define bFM4_MFS12_LIN_SMR_SOE                 *((volatile unsigned int*)(0x42718000UL))
#define bFM4_MFS12_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4271800CUL))
#define bFM4_MFS12_LIN_SMR_WUCR                *((volatile unsigned int*)(0x42718010UL))
#define bFM4_MFS12_LIN_SMR_MD0                 *((volatile unsigned int*)(0x42718014UL))
#define bFM4_MFS12_LIN_SMR_MD1                 *((volatile unsigned int*)(0x42718018UL))
#define bFM4_MFS12_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4271801CUL))
#define bFM4_MFS12_LIN_SCR_TXE                 *((volatile unsigned int*)(0x42718020UL))
#define bFM4_MFS12_LIN_SCR_RXE                 *((volatile unsigned int*)(0x42718024UL))
#define bFM4_MFS12_LIN_SCR_TBIE                *((volatile unsigned int*)(0x42718028UL))
#define bFM4_MFS12_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4271802CUL))
#define bFM4_MFS12_LIN_SCR_RIE                 *((volatile unsigned int*)(0x42718030UL))
#define bFM4_MFS12_LIN_SCR_LBR                 *((volatile unsigned int*)(0x42718034UL))
#define bFM4_MFS12_LIN_SCR_MS                  *((volatile unsigned int*)(0x42718038UL))
#define bFM4_MFS12_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4271803CUL))
#define bFM4_MFS12_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x42718080UL))
#define bFM4_MFS12_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x42718084UL))
#define bFM4_MFS12_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x42718088UL))
#define bFM4_MFS12_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4271808CUL))
#define bFM4_MFS12_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x42718090UL))
#define bFM4_MFS12_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x42718098UL))
#define bFM4_MFS12_LIN_SSR_TBI                 *((volatile unsigned int*)(0x427180A0UL))
#define bFM4_MFS12_LIN_SSR_TDRE                *((volatile unsigned int*)(0x427180A4UL))
#define bFM4_MFS12_LIN_SSR_RDRF                *((volatile unsigned int*)(0x427180A8UL))
#define bFM4_MFS12_LIN_SSR_ORE                 *((volatile unsigned int*)(0x427180ACUL))
#define bFM4_MFS12_LIN_SSR_FRE                 *((volatile unsigned int*)(0x427180B0UL))
#define bFM4_MFS12_LIN_SSR_LBD                 *((volatile unsigned int*)(0x427180B4UL))
#define bFM4_MFS12_LIN_SSR_REC                 *((volatile unsigned int*)(0x427180BCUL))
#define bFM4_MFS12_LIN_BGR_EXT                 *((volatile unsigned int*)(0x427181BCUL))
#define bFM4_MFS12_LIN_BGR1_EXT                *((volatile unsigned int*)(0x427181BCUL))
#define bFM4_MFS12_LIN_FCR_FE1                 *((volatile unsigned int*)(0x42718280UL))
#define bFM4_MFS12_LIN_FCR_FE2                 *((volatile unsigned int*)(0x42718284UL))
#define bFM4_MFS12_LIN_FCR_FCL1                *((volatile unsigned int*)(0x42718288UL))
#define bFM4_MFS12_LIN_FCR_FCL2                *((volatile unsigned int*)(0x4271828CUL))
#define bFM4_MFS12_LIN_FCR_FSET                *((volatile unsigned int*)(0x42718290UL))
#define bFM4_MFS12_LIN_FCR_FLD                 *((volatile unsigned int*)(0x42718294UL))
#define bFM4_MFS12_LIN_FCR_FLST                *((volatile unsigned int*)(0x42718298UL))
#define bFM4_MFS12_LIN_FCR_FSEL                *((volatile unsigned int*)(0x427182A0UL))
#define bFM4_MFS12_LIN_FCR_FTIE                *((volatile unsigned int*)(0x427182A4UL))
#define bFM4_MFS12_LIN_FCR_FDRQ                *((volatile unsigned int*)(0x427182A8UL))
#define bFM4_MFS12_LIN_FCR_FRIIE               *((volatile unsigned int*)(0x427182ACUL))
#define bFM4_MFS12_LIN_FCR_FLSTE               *((volatile unsigned int*)(0x427182B0UL))
#define bFM4_MFS12_LIN_FCR0_FE1                *((volatile unsigned int*)(0x42718280UL))
#define bFM4_MFS12_LIN_FCR0_FE2                *((volatile unsigned int*)(0x42718284UL))
#define bFM4_MFS12_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x42718288UL))
#define bFM4_MFS12_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4271828CUL))
#define bFM4_MFS12_LIN_FCR0_FSET               *((volatile unsigned int*)(0x42718290UL))
#define bFM4_MFS12_LIN_FCR0_FLD                *((volatile unsigned int*)(0x42718294UL))
#define bFM4_MFS12_LIN_FCR0_FLST               *((volatile unsigned int*)(0x42718298UL))
#define bFM4_MFS12_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x427182A0UL))
#define bFM4_MFS12_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x427182A4UL))
#define bFM4_MFS12_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x427182A8UL))
#define bFM4_MFS12_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x427182ACUL))
#define bFM4_MFS12_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x427182B0UL))
#define bFM4_MFS12_LIN_FBYTE_FD0               *((volatile unsigned int*)(0x42718300UL))
#define bFM4_MFS12_LIN_FBYTE_FD1               *((volatile unsigned int*)(0x42718304UL))
#define bFM4_MFS12_LIN_FBYTE_FD2               *((volatile unsigned int*)(0x42718308UL))
#define bFM4_MFS12_LIN_FBYTE_FD3               *((volatile unsigned int*)(0x4271830CUL))
#define bFM4_MFS12_LIN_FBYTE_FD4               *((volatile unsigned int*)(0x42718310UL))
#define bFM4_MFS12_LIN_FBYTE_FD5               *((volatile unsigned int*)(0x42718314UL))
#define bFM4_MFS12_LIN_FBYTE_FD6               *((volatile unsigned int*)(0x42718318UL))
#define bFM4_MFS12_LIN_FBYTE_FD7               *((volatile unsigned int*)(0x4271831CUL))
#define bFM4_MFS12_LIN_FBYTE_FD8               *((volatile unsigned int*)(0x42718320UL))
#define bFM4_MFS12_LIN_FBYTE_FD9               *((volatile unsigned int*)(0x42718324UL))
#define bFM4_MFS12_LIN_FBYTE_FD10              *((volatile unsigned int*)(0x42718328UL))
#define bFM4_MFS12_LIN_FBYTE_FD11              *((volatile unsigned int*)(0x4271832CUL))
#define bFM4_MFS12_LIN_FBYTE_FD12              *((volatile unsigned int*)(0x42718330UL))
#define bFM4_MFS12_LIN_FBYTE_FD13              *((volatile unsigned int*)(0x42718334UL))
#define bFM4_MFS12_LIN_FBYTE_FD14              *((volatile unsigned int*)(0x42718338UL))
#define bFM4_MFS12_LIN_FBYTE_FD15              *((volatile unsigned int*)(0x4271833CUL))
#define bFM4_MFS12_LIN_FBYTE1_FD0              *((volatile unsigned int*)(0x42718300UL))
#define bFM4_MFS12_LIN_FBYTE1_FD1              *((volatile unsigned int*)(0x42718304UL))
#define bFM4_MFS12_LIN_FBYTE1_FD2              *((volatile unsigned int*)(0x42718308UL))
#define bFM4_MFS12_LIN_FBYTE1_FD3              *((volatile unsigned int*)(0x4271830CUL))
#define bFM4_MFS12_LIN_FBYTE1_FD4              *((volatile unsigned int*)(0x42718310UL))
#define bFM4_MFS12_LIN_FBYTE1_FD5              *((volatile unsigned int*)(0x42718314UL))
#define bFM4_MFS12_LIN_FBYTE1_FD6              *((volatile unsigned int*)(0x42718318UL))
#define bFM4_MFS12_LIN_FBYTE1_FD7              *((volatile unsigned int*)(0x4271831CUL))
#define bFM4_MFS12_LIN_FBYTE2_FD8              *((volatile unsigned int*)(0x42718320UL))
#define bFM4_MFS12_LIN_FBYTE2_FD9              *((volatile unsigned int*)(0x42718324UL))
#define bFM4_MFS12_LIN_FBYTE2_FD10             *((volatile unsigned int*)(0x42718328UL))
#define bFM4_MFS12_LIN_FBYTE2_FD11             *((volatile unsigned int*)(0x4271832CUL))
#define bFM4_MFS12_LIN_FBYTE2_FD12             *((volatile unsigned int*)(0x42718330UL))
#define bFM4_MFS12_LIN_FBYTE2_FD13             *((volatile unsigned int*)(0x42718334UL))
#define bFM4_MFS12_LIN_FBYTE2_FD14             *((volatile unsigned int*)(0x42718338UL))
#define bFM4_MFS12_LIN_FBYTE2_FD15             *((volatile unsigned int*)(0x4271833CUL))

