snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS I2C channel 12 registers */
#define bFM4_MFS12_I2C_SMR_TIE                 *((volatile unsigned int*)(0x42718008UL))
#define bFM4_MFS12_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4271800CUL))
#define bFM4_MFS12_I2C_SMR_MD0                 *((volatile unsigned int*)(0x42718014UL))
#define bFM4_MFS12_I2C_SMR_MD1                 *((volatile unsigned int*)(0x42718018UL))
#define bFM4_MFS12_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4271801CUL))
#define bFM4_MFS12_I2C_IBCR_INT                *((volatile unsigned int*)(0x42718020UL))
#define bFM4_MFS12_I2C_IBCR_BER                *((volatile unsigned int*)(0x42718024UL))
#define bFM4_MFS12_I2C_IBCR_INTE               *((volatile unsigned int*)(0x42718028UL))
#define bFM4_MFS12_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4271802CUL))
#define bFM4_MFS12_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x42718030UL))
#define bFM4_MFS12_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x42718034UL))
#define bFM4_MFS12_I2C_IBCR_ACT                *((volatile unsigned int*)(0x42718038UL))
#define bFM4_MFS12_I2C_IBCR_SCC                *((volatile unsigned int*)(0x42718038UL))
#define bFM4_MFS12_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4271803CUL))
#define bFM4_MFS12_I2C_IBSR_BB                 *((volatile unsigned int*)(0x42718080UL))
#define bFM4_MFS12_I2C_IBSR_SPC                *((volatile unsigned int*)(0x42718084UL))
#define bFM4_MFS12_I2C_IBSR_RSC                *((volatile unsigned int*)(0x42718088UL))
#define bFM4_MFS12_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4271808CUL))
#define bFM4_MFS12_I2C_IBSR_TRX                *((volatile unsigned int*)(0x42718090UL))
#define bFM4_MFS12_I2C_IBSR_RSA                *((volatile unsigned int*)(0x42718094UL))
#define bFM4_MFS12_I2C_IBSR_RACK               *((volatile unsigned int*)(0x42718098UL))
#define bFM4_MFS12_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4271809CUL))
#define bFM4_MFS12_I2C_SSR_TBI                 *((volatile unsigned int*)(0x427180A0UL))
#define bFM4_MFS12_I2C_SSR_TDRE                *((volatile unsigned int*)(0x427180A4UL))
#define bFM4_MFS12_I2C_SSR_RDRF                *((volatile unsigned int*)(0x427180A8UL))
#define bFM4_MFS12_I2C_SSR_ORE                 *((volatile unsigned int*)(0x427180ACUL))
#define bFM4_MFS12_I2C_SSR_TBIE                *((volatile unsigned int*)(0x427180B0UL))
#define bFM4_MFS12_I2C_SSR_DMA                 *((volatile unsigned int*)(0x427180B4UL))
#define bFM4_MFS12_I2C_SSR_TSET                *((volatile unsigned int*)(0x427180B8UL))
#define bFM4_MFS12_I2C_SSR_REC                 *((volatile unsigned int*)(0x427180BCUL))
#define bFM4_MFS12_I2C_ISBA_SA0                *((volatile unsigned int*)(0x42718200UL))
#define bFM4_MFS12_I2C_ISBA_SA1                *((volatile unsigned int*)(0x42718204UL))
#define bFM4_MFS12_I2C_ISBA_SA2                *((volatile unsigned int*)(0x42718208UL))
#define bFM4_MFS12_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4271820CUL))
#define bFM4_MFS12_I2C_ISBA_SA4                *((volatile unsigned int*)(0x42718210UL))
#define bFM4_MFS12_I2C_ISBA_SA5                *((volatile unsigned int*)(0x42718214UL))
#define bFM4_MFS12_I2C_ISBA_SA6                *((volatile unsigned int*)(0x42718218UL))
#define bFM4_MFS12_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4271821CUL))
#define bFM4_MFS12_I2C_ISMK_SM0                *((volatile unsigned int*)(0x42718220UL))
#define bFM4_MFS12_I2C_ISMK_SM1                *((volatile unsigned int*)(0x42718224UL))
#define bFM4_MFS12_I2C_ISMK_SM2                *((volatile unsigned int*)(0x42718228UL))
#define bFM4_MFS12_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4271822CUL))
#define bFM4_MFS12_I2C_ISMK_SM4                *((volatile unsigned int*)(0x42718230UL))
#define bFM4_MFS12_I2C_ISMK_SM5                *((volatile unsigned int*)(0x42718234UL))
#define bFM4_MFS12_I2C_ISMK_SM6                *((volatile unsigned int*)(0x42718238UL))
#define bFM4_MFS12_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4271823CUL))
#define bFM4_MFS12_I2C_FCR_FE1                 *((volatile unsigned int*)(0x42718280UL))
#define bFM4_MFS12_I2C_FCR_FE2                 *((volatile unsigned int*)(0x42718284UL))
#define bFM4_MFS12_I2C_FCR_FCL1                *((volatile unsigned int*)(0x42718288UL))
#define bFM4_MFS12_I2C_FCR_FCL2                *((volatile unsigned int*)(0x4271828CUL))
#define bFM4_MFS12_I2C_FCR_FSET                *((volatile unsigned int*)(0x42718290UL))
#define bFM4_MFS12_I2C_FCR_FLD                 *((volatile unsigned int*)(0x42718294UL))
#define bFM4_MFS12_I2C_FCR_FLST                *((volatile unsigned int*)(0x42718298UL))
#define bFM4_MFS12_I2C_FCR_FSEL                *((volatile unsigned int*)(0x427182A0UL))
#define bFM4_MFS12_I2C_FCR_FTIE                *((volatile unsigned int*)(0x427182A4UL))
#define bFM4_MFS12_I2C_FCR_FDRQ                *((volatile unsigned int*)(0x427182A8UL))
#define bFM4_MFS12_I2C_FCR_FRIIE               *((volatile unsigned int*)(0x427182ACUL))
#define bFM4_MFS12_I2C_FCR_FLSTE               *((volatile unsigned int*)(0x427182B0UL))
#define bFM4_MFS12_I2C_FCR0_FE1                *((volatile unsigned int*)(0x42718280UL))
#define bFM4_MFS12_I2C_FCR0_FE2                *((volatile unsigned int*)(0x42718284UL))
#define bFM4_MFS12_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x42718288UL))
#define bFM4_MFS12_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4271828CUL))
#define bFM4_MFS12_I2C_FCR0_FSET               *((volatile unsigned int*)(0x42718290UL))
#define bFM4_MFS12_I2C_FCR0_FLD                *((volatile unsigned int*)(0x42718294UL))
#define bFM4_MFS12_I2C_FCR0_FLST               *((volatile unsigned int*)(0x42718298UL))
#define bFM4_MFS12_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x427182A0UL))
#define bFM4_MFS12_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x427182A4UL))
#define bFM4_MFS12_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x427182A8UL))
#define bFM4_MFS12_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x427182ACUL))
#define bFM4_MFS12_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x427182B0UL))
#define bFM4_MFS12_I2C_FBYTE_FD0               *((volatile unsigned int*)(0x42718300UL))
#define bFM4_MFS12_I2C_FBYTE_FD1               *((volatile unsigned int*)(0x42718304UL))
#define bFM4_MFS12_I2C_FBYTE_FD2               *((volatile unsigned int*)(0x42718308UL))
#define bFM4_MFS12_I2C_FBYTE_FD3               *((volatile unsigned int*)(0x4271830CUL))
#define bFM4_MFS12_I2C_FBYTE_FD4               *((volatile unsigned int*)(0x42718310UL))
#define bFM4_MFS12_I2C_FBYTE_FD5               *((volatile unsigned int*)(0x42718314UL))
#define bFM4_MFS12_I2C_FBYTE_FD6               *((volatile unsigned int*)(0x42718318UL))
#define bFM4_MFS12_I2C_FBYTE_FD7               *((volatile unsigned int*)(0x4271831CUL))
#define bFM4_MFS12_I2C_FBYTE_FD8               *((volatile unsigned int*)(0x42718320UL))
#define bFM4_MFS12_I2C_FBYTE_FD9               *((volatile unsigned int*)(0x42718324UL))
#define bFM4_MFS12_I2C_FBYTE_FD10              *((volatile unsigned int*)(0x42718328UL))
#define bFM4_MFS12_I2C_FBYTE_FD11              *((volatile unsigned int*)(0x4271832CUL))
#define bFM4_MFS12_I2C_FBYTE_FD12              *((volatile unsigned int*)(0x42718330UL))
#define bFM4_MFS12_I2C_FBYTE_FD13              *((volatile unsigned int*)(0x42718334UL))
#define bFM4_MFS12_I2C_FBYTE_FD14              *((volatile unsigned int*)(0x42718338UL))
#define bFM4_MFS12_I2C_FBYTE_FD15              *((volatile unsigned int*)(0x4271833CUL))
#define bFM4_MFS12_I2C_FBYTE1_FD0              *((volatile unsigned int*)(0x42718300UL))
#define bFM4_MFS12_I2C_FBYTE1_FD1              *((volatile unsigned int*)(0x42718304UL))
#define bFM4_MFS12_I2C_FBYTE1_FD2              *((volatile unsigned int*)(0x42718308UL))
#define bFM4_MFS12_I2C_FBYTE1_FD3              *((volatile unsigned int*)(0x4271830CUL))
#define bFM4_MFS12_I2C_FBYTE1_FD4              *((volatile unsigned int*)(0x42718310UL))
#define bFM4_MFS12_I2C_FBYTE1_FD5              *((volatile unsigned int*)(0x42718314UL))
#define bFM4_MFS12_I2C_FBYTE1_FD6              *((volatile unsigned int*)(0x42718318UL))
#define bFM4_MFS12_I2C_FBYTE1_FD7              *((volatile unsigned int*)(0x4271831CUL))
#define bFM4_MFS12_I2C_FBYTE2_FD8              *((volatile unsigned int*)(0x42718320UL))
#define bFM4_MFS12_I2C_FBYTE2_FD9              *((volatile unsigned int*)(0x42718324UL))
#define bFM4_MFS12_I2C_FBYTE2_FD10             *((volatile unsigned int*)(0x42718328UL))
#define bFM4_MFS12_I2C_FBYTE2_FD11             *((volatile unsigned int*)(0x4271832CUL))
#define bFM4_MFS12_I2C_FBYTE2_FD12             *((volatile unsigned int*)(0x42718330UL))
#define bFM4_MFS12_I2C_FBYTE2_FD13             *((volatile unsigned int*)(0x42718334UL))
#define bFM4_MFS12_I2C_FBYTE2_FD14             *((volatile unsigned int*)(0x42718338UL))
#define bFM4_MFS12_I2C_FBYTE2_FD15             *((volatile unsigned int*)(0x4271833CUL))

/* MFS UART channel 13 registers */
#define bFM4_MFS13_UART_SMR_SOE                *((volatile unsigned int*)(0x4271A000UL))
#define bFM4_MFS13_UART_SMR_BDS                *((volatile unsigned int*)(0x4271A008UL))
#define bFM4_MFS13_UART_SMR_SBL                *((volatile unsigned int*)(0x4271A00CUL))
#define bFM4_MFS13_UART_SMR_WUCR               *((volatile unsigned int*)(0x4271A010UL))
#define bFM4_MFS13_UART_SMR_MD0                *((volatile unsigned int*)(0x4271A014UL))
#define bFM4_MFS13_UART_SMR_MD1                *((volatile unsigned int*)(0x4271A018UL))
#define bFM4_MFS13_UART_SMR_MD2                *((volatile unsigned int*)(0x4271A01CUL))
#define bFM4_MFS13_UART_SCR_TXE                *((volatile unsigned int*)(0x4271A020UL))
#define bFM4_MFS13_UART_SCR_RXE                *((volatile unsigned int*)(0x4271A024UL))
#define bFM4_MFS13_UART_SCR_TBIE               *((volatile unsigned int*)(0x4271A028UL))
#define bFM4_MFS13_UART_SCR_TIE                *((volatile unsigned int*)(0x4271A02CUL))
#define bFM4_MFS13_UART_SCR_RIE                *((volatile unsigned int*)(0x4271A030UL))
#define bFM4_MFS13_UART_SCR_UPCL               *((volatile unsigned int*)(0x4271A03CUL))
#define bFM4_MFS13_UART_ESCR_L0                *((volatile unsigned int*)(0x4271A080UL))
#define bFM4_MFS13_UART_ESCR_L1                *((volatile unsigned int*)(0x4271A084UL))
#define bFM4_MFS13_UART_ESCR_L2                *((volatile unsigned int*)(0x4271A088UL))
#define bFM4_MFS13_UART_ESCR_P                 *((volatile unsigned int*)(0x4271A08CUL))
#define bFM4_MFS13_UART_ESCR_PEN               *((volatile unsigned int*)(0x4271A090UL))
#define bFM4_MFS13_UART_ESCR_INV               *((volatile unsigned int*)(0x4271A094UL))
#define bFM4_MFS13_UART_ESCR_ESBL              *((volatile unsigned int*)(0x4271A098UL))
#define bFM4_MFS13_UART_ESCR_FLWEN             *((volatile unsigned int*)(0x4271A09CUL))
#define bFM4_MFS13_UART_SSR_TBI                *((volatile unsigned int*)(0x4271A0A0UL))
#define bFM4_MFS13_UART_SSR_TDRE               *((volatile unsigned int*)(0x4271A0A4UL))
#define bFM4_MFS13_UART_SSR_RDRF               *((volatile unsigned int*)(0x4271A0A8UL))
#define bFM4_MFS13_UART_SSR_ORE                *((volatile unsigned int*)(0x4271A0ACUL))
#define bFM4_MFS13_UART_SSR_FRE                *((volatile unsigned int*)(0x4271A0B0UL))
#define bFM4_MFS13_UART_SSR_PE                 *((volatile unsigned int*)(0x4271A0B4UL))
#define bFM4_MFS13_UART_SSR_REC                *((volatile unsigned int*)(0x4271A0BCUL))
#define bFM4_MFS13_UART_RDR_AD                 *((volatile unsigned int*)(0x4271A120UL))
#define bFM4_MFS13_UART_TDR_AD                 *((volatile unsigned int*)(0x4271A120UL))
#define bFM4_MFS13_UART_BGR_EXT                *((volatile unsigned int*)(0x4271A1BCUL))
#define bFM4_MFS13_UART_BGR1_EXT               *((volatile unsigned int*)(0x4271A1BCUL))
#define bFM4_MFS13_UART_FCR_FE1                *((volatile unsigned int*)(0x4271A280UL))
#define bFM4_MFS13_UART_FCR_FE2                *((volatile unsigned int*)(0x4271A284UL))
#define bFM4_MFS13_UART_FCR_FCL1               *((volatile unsigned int*)(0x4271A288UL))
#define bFM4_MFS13_UART_FCR_FCL2               *((volatile unsigned int*)(0x4271A28CUL))
#define bFM4_MFS13_UART_FCR_FSET               *((volatile unsigned int*)(0x4271A290UL))
#define bFM4_MFS13_UART_FCR_FLD                *((volatile unsigned int*)(0x4271A294UL))
#define bFM4_MFS13_UART_FCR_FLST               *((volatile unsigned int*)(0x4271A298UL))
#define bFM4_MFS13_UART_FCR_FSEL               *((volatile unsigned int*)(0x4271A2A0UL))
#define bFM4_MFS13_UART_FCR_FTIE               *((volatile unsigned int*)(0x4271A2A4UL))
#define bFM4_MFS13_UART_FCR_FDRQ               *((volatile unsigned int*)(0x4271A2A8UL))
#define bFM4_MFS13_UART_FCR_FRIIE              *((volatile unsigned int*)(0x4271A2ACUL))
#define bFM4_MFS13_UART_FCR_FLSTE              *((volatile unsigned int*)(0x4271A2B0UL))
#define bFM4_MFS13_UART_FCR0_FE1               *((volatile unsigned int*)(0x4271A280UL))
#define bFM4_MFS13_UART_FCR0_FE2               *((volatile unsigned int*)(0x4271A284UL))
#define bFM4_MFS13_UART_FCR0_FCL1              *((volatile unsigned int*)(0x4271A288UL))
#define bFM4_MFS13_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4271A28CUL))
#define bFM4_MFS13_UART_FCR0_FSET              *((volatile unsigned int*)(0x4271A290UL))
#define bFM4_MFS13_UART_FCR0_FLD               *((volatile unsigned int*)(0x4271A294UL))
#define bFM4_MFS13_UART_FCR0_FLST              *((volatile unsigned int*)(0x4271A298UL))
#define bFM4_MFS13_UART_FCR1_FSEL              *((volatile unsigned int*)(0x4271A2A0UL))
#define bFM4_MFS13_UART_FCR1_FTIE              *((volatile unsigned int*)(0x4271A2A4UL))
#define bFM4_MFS13_UART_FCR1_FDRQ              *((volatile unsigned int*)(0x4271A2A8UL))
#define bFM4_MFS13_UART_FCR1_FRIIE             *((volatile unsigned int*)(0x4271A2ACUL))
#define bFM4_MFS13_UART_FCR1_FLSTE             *((volatile unsigned int*)(0x4271A2B0UL))
#define bFM4_MFS13_UART_FBYTE_FD0              *((volatile unsigned int*)(0x4271A300UL))
#define bFM4_MFS13_UART_FBYTE_FD1              *((volatile unsigned int*)(0x4271A304UL))
#define bFM4_MFS13_UART_FBYTE_FD2              *((volatile unsigned int*)(0x4271A308UL))
#define bFM4_MFS13_UART_FBYTE_FD3              *((volatile unsigned int*)(0x4271A30CUL))
#define bFM4_MFS13_UART_FBYTE_FD4              *((volatile unsigned int*)(0x4271A310UL))
#define bFM4_MFS13_UART_FBYTE_FD5              *((volatile unsigned int*)(0x4271A314UL))
#define bFM4_MFS13_UART_FBYTE_FD6              *((volatile unsigned int*)(0x4271A318UL))
#define bFM4_MFS13_UART_FBYTE_FD7              *((volatile unsigned int*)(0x4271A31CUL))
#define bFM4_MFS13_UART_FBYTE_FD8              *((volatile unsigned int*)(0x4271A320UL))
#define bFM4_MFS13_UART_FBYTE_FD9              *((volatile unsigned int*)(0x4271A324UL))
#define bFM4_MFS13_UART_FBYTE_FD10             *((volatile unsigned int*)(0x4271A328UL))
#define bFM4_MFS13_UART_FBYTE_FD11             *((volatile unsigned int*)(0x4271A32CUL))
#define bFM4_MFS13_UART_FBYTE_FD12             *((volatile unsigned int*)(0x4271A330UL))
#define bFM4_MFS13_UART_FBYTE_FD13             *((volatile unsigned int*)(0x4271A334UL))
#define bFM4_MFS13_UART_FBYTE_FD14             *((volatile unsigned int*)(0x4271A338UL))
#define bFM4_MFS13_UART_FBYTE_FD15             *((volatile unsigned int*)(0x4271A33CUL))
#define bFM4_MFS13_UART_FBYTE1_FD0             *((volatile unsigned int*)(0x4271A300UL))
#define bFM4_MFS13_UART_FBYTE1_FD1             *((volatile unsigned int*)(0x4271A304UL))
#define bFM4_MFS13_UART_FBYTE1_FD2             *((volatile unsigned int*)(0x4271A308UL))
#define bFM4_MFS13_UART_FBYTE1_FD3             *((volatile unsigned int*)(0x4271A30CUL))
#define bFM4_MFS13_UART_FBYTE1_FD4             *((volatile unsigned int*)(0x4271A310UL))
#define bFM4_MFS13_UART_FBYTE1_FD5             *((volatile unsigned int*)(0x4271A314UL))
#define bFM4_MFS13_UART_FBYTE1_FD6             *((volatile unsigned int*)(0x4271A318UL))
#define bFM4_MFS13_UART_FBYTE1_FD7             *((volatile unsigned int*)(0x4271A31CUL))
#define bFM4_MFS13_UART_FBYTE2_FD8             *((volatile unsigned int*)(0x4271A320UL))
#define bFM4_MFS13_UART_FBYTE2_FD9             *((volatile unsigned int*)(0x4271A324UL))
#define bFM4_MFS13_UART_FBYTE2_FD10            *((volatile unsigned int*)(0x4271A328UL))
#define bFM4_MFS13_UART_FBYTE2_FD11            *((volatile unsigned int*)(0x4271A32CUL))
#define bFM4_MFS13_UART_FBYTE2_FD12            *((volatile unsigned int*)(0x4271A330UL))
#define bFM4_MFS13_UART_FBYTE2_FD13            *((volatile unsigned int*)(0x4271A334UL))
#define bFM4_MFS13_UART_FBYTE2_FD14            *((volatile unsigned int*)(0x4271A338UL))
#define bFM4_MFS13_UART_FBYTE2_FD15            *((volatile unsigned int*)(0x4271A33CUL))

