snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS I2C channel 14 registers */
#define bFM4_MFS14_I2C_SMR_TIE                 *((volatile unsigned int*)(0x4271C008UL))
#define bFM4_MFS14_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4271C00CUL))
#define bFM4_MFS14_I2C_SMR_MD0                 *((volatile unsigned int*)(0x4271C014UL))
#define bFM4_MFS14_I2C_SMR_MD1                 *((volatile unsigned int*)(0x4271C018UL))
#define bFM4_MFS14_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4271C01CUL))
#define bFM4_MFS14_I2C_IBCR_INT                *((volatile unsigned int*)(0x4271C020UL))
#define bFM4_MFS14_I2C_IBCR_BER                *((volatile unsigned int*)(0x4271C024UL))
#define bFM4_MFS14_I2C_IBCR_INTE               *((volatile unsigned int*)(0x4271C028UL))
#define bFM4_MFS14_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4271C02CUL))
#define bFM4_MFS14_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x4271C030UL))
#define bFM4_MFS14_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x4271C034UL))
#define bFM4_MFS14_I2C_IBCR_ACT                *((volatile unsigned int*)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_SCC                *((volatile unsigned int*)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4271C03CUL))
#define bFM4_MFS14_I2C_IBSR_BB                 *((volatile unsigned int*)(0x4271C080UL))
#define bFM4_MFS14_I2C_IBSR_SPC                *((volatile unsigned int*)(0x4271C084UL))
#define bFM4_MFS14_I2C_IBSR_RSC                *((volatile unsigned int*)(0x4271C088UL))
#define bFM4_MFS14_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4271C08CUL))
#define bFM4_MFS14_I2C_IBSR_TRX                *((volatile unsigned int*)(0x4271C090UL))
#define bFM4_MFS14_I2C_IBSR_RSA                *((volatile unsigned int*)(0x4271C094UL))
#define bFM4_MFS14_I2C_IBSR_RACK               *((volatile unsigned int*)(0x4271C098UL))
#define bFM4_MFS14_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4271C09CUL))
#define bFM4_MFS14_I2C_SSR_TBI                 *((volatile unsigned int*)(0x4271C0A0UL))
#define bFM4_MFS14_I2C_SSR_TDRE                *((volatile unsigned int*)(0x4271C0A4UL))
#define bFM4_MFS14_I2C_SSR_RDRF                *((volatile unsigned int*)(0x4271C0A8UL))
#define bFM4_MFS14_I2C_SSR_ORE                 *((volatile unsigned int*)(0x4271C0ACUL))
#define bFM4_MFS14_I2C_SSR_TBIE                *((volatile unsigned int*)(0x4271C0B0UL))
#define bFM4_MFS14_I2C_SSR_DMA                 *((volatile unsigned int*)(0x4271C0B4UL))
#define bFM4_MFS14_I2C_SSR_TSET                *((volatile unsigned int*)(0x4271C0B8UL))
#define bFM4_MFS14_I2C_SSR_REC                 *((volatile unsigned int*)(0x4271C0BCUL))
#define bFM4_MFS14_I2C_ISBA_SA0                *((volatile unsigned int*)(0x4271C200UL))
#define bFM4_MFS14_I2C_ISBA_SA1                *((volatile unsigned int*)(0x4271C204UL))
#define bFM4_MFS14_I2C_ISBA_SA2                *((volatile unsigned int*)(0x4271C208UL))
#define bFM4_MFS14_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4271C20CUL))
#define bFM4_MFS14_I2C_ISBA_SA4                *((volatile unsigned int*)(0x4271C210UL))
#define bFM4_MFS14_I2C_ISBA_SA5                *((volatile unsigned int*)(0x4271C214UL))
#define bFM4_MFS14_I2C_ISBA_SA6                *((volatile unsigned int*)(0x4271C218UL))
#define bFM4_MFS14_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4271C21CUL))
#define bFM4_MFS14_I2C_ISMK_SM0                *((volatile unsigned int*)(0x4271C220UL))
#define bFM4_MFS14_I2C_ISMK_SM1                *((volatile unsigned int*)(0x4271C224UL))
#define bFM4_MFS14_I2C_ISMK_SM2                *((volatile unsigned int*)(0x4271C228UL))
#define bFM4_MFS14_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4271C22CUL))
#define bFM4_MFS14_I2C_ISMK_SM4                *((volatile unsigned int*)(0x4271C230UL))
#define bFM4_MFS14_I2C_ISMK_SM5                *((volatile unsigned int*)(0x4271C234UL))
#define bFM4_MFS14_I2C_ISMK_SM6                *((volatile unsigned int*)(0x4271C238UL))
#define bFM4_MFS14_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4271C23CUL))
#define bFM4_MFS14_I2C_FCR_FE1                 *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR_FE2                 *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR_FCL1                *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR_FCL2                *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR_FSET                *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR_FLD                 *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR_FLST                *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR_FSEL                *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR_FTIE                *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR_FDRQ                *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR_FRIIE               *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR_FLSTE               *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FCR0_FE1                *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR0_FE2                *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR0_FSET               *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR0_FLD                *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR0_FLST               *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FBYTE_FD0               *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_I2C_FBYTE_FD1               *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_I2C_FBYTE_FD2               *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_I2C_FBYTE_FD3               *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_I2C_FBYTE_FD4               *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_I2C_FBYTE_FD5               *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_I2C_FBYTE_FD6               *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_I2C_FBYTE_FD7               *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_I2C_FBYTE_FD8               *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_I2C_FBYTE_FD9               *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_I2C_FBYTE_FD10              *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_I2C_FBYTE_FD11              *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_I2C_FBYTE_FD12              *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_I2C_FBYTE_FD13              *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_I2C_FBYTE_FD14              *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_I2C_FBYTE_FD15              *((volatile unsigned int*)(0x4271C33CUL))
#define bFM4_MFS14_I2C_FBYTE1_FD0              *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_I2C_FBYTE1_FD1              *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_I2C_FBYTE1_FD2              *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_I2C_FBYTE1_FD3              *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_I2C_FBYTE1_FD4              *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_I2C_FBYTE1_FD5              *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_I2C_FBYTE1_FD6              *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_I2C_FBYTE1_FD7              *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_I2C_FBYTE2_FD8              *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_I2C_FBYTE2_FD9              *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_I2C_FBYTE2_FD10             *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_I2C_FBYTE2_FD11             *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_I2C_FBYTE2_FD12             *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_I2C_FBYTE2_FD13             *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_I2C_FBYTE2_FD14             *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_I2C_FBYTE2_FD15             *((volatile unsigned int*)(0x4271C33CUL))

/* MFS UART channel 15 registers */
#define bFM4_MFS15_UART_SMR_SOE                *((volatile unsigned int*)(0x4271E000UL))
#define bFM4_MFS15_UART_SMR_BDS                *((volatile unsigned int*)(0x4271E008UL))
#define bFM4_MFS15_UART_SMR_SBL                *((volatile unsigned int*)(0x4271E00CUL))
#define bFM4_MFS15_UART_SMR_WUCR               *((volatile unsigned int*)(0x4271E010UL))
#define bFM4_MFS15_UART_SMR_MD0                *((volatile unsigned int*)(0x4271E014UL))
#define bFM4_MFS15_UART_SMR_MD1                *((volatile unsigned int*)(0x4271E018UL))
#define bFM4_MFS15_UART_SMR_MD2                *((volatile unsigned int*)(0x4271E01CUL))
#define bFM4_MFS15_UART_SCR_TXE                *((volatile unsigned int*)(0x4271E020UL))
#define bFM4_MFS15_UART_SCR_RXE                *((volatile unsigned int*)(0x4271E024UL))
#define bFM4_MFS15_UART_SCR_TBIE               *((volatile unsigned int*)(0x4271E028UL))
#define bFM4_MFS15_UART_SCR_TIE                *((volatile unsigned int*)(0x4271E02CUL))
#define bFM4_MFS15_UART_SCR_RIE                *((volatile unsigned int*)(0x4271E030UL))
#define bFM4_MFS15_UART_SCR_UPCL               *((volatile unsigned int*)(0x4271E03CUL))
#define bFM4_MFS15_UART_ESCR_L0                *((volatile unsigned int*)(0x4271E080UL))
#define bFM4_MFS15_UART_ESCR_L1                *((volatile unsigned int*)(0x4271E084UL))
#define bFM4_MFS15_UART_ESCR_L2                *((volatile unsigned int*)(0x4271E088UL))
#define bFM4_MFS15_UART_ESCR_P                 *((volatile unsigned int*)(0x4271E08CUL))
#define bFM4_MFS15_UART_ESCR_PEN               *((volatile unsigned int*)(0x4271E090UL))
#define bFM4_MFS15_UART_ESCR_INV               *((volatile unsigned int*)(0x4271E094UL))
#define bFM4_MFS15_UART_ESCR_ESBL              *((volatile unsigned int*)(0x4271E098UL))
#define bFM4_MFS15_UART_ESCR_FLWEN             *((volatile unsigned int*)(0x4271E09CUL))
#define bFM4_MFS15_UART_SSR_TBI                *((volatile unsigned int*)(0x4271E0A0UL))
#define bFM4_MFS15_UART_SSR_TDRE               *((volatile unsigned int*)(0x4271E0A4UL))
#define bFM4_MFS15_UART_SSR_RDRF               *((volatile unsigned int*)(0x4271E0A8UL))
#define bFM4_MFS15_UART_SSR_ORE                *((volatile unsigned int*)(0x4271E0ACUL))
#define bFM4_MFS15_UART_SSR_FRE                *((volatile unsigned int*)(0x4271E0B0UL))
#define bFM4_MFS15_UART_SSR_PE                 *((volatile unsigned int*)(0x4271E0B4UL))
#define bFM4_MFS15_UART_SSR_REC                *((volatile unsigned int*)(0x4271E0BCUL))
#define bFM4_MFS15_UART_RDR_AD                 *((volatile unsigned int*)(0x4271E120UL))
#define bFM4_MFS15_UART_TDR_AD                 *((volatile unsigned int*)(0x4271E120UL))
#define bFM4_MFS15_UART_BGR_EXT                *((volatile unsigned int*)(0x4271E1BCUL))
#define bFM4_MFS15_UART_BGR1_EXT               *((volatile unsigned int*)(0x4271E1BCUL))
#define bFM4_MFS15_UART_FCR_FE1                *((volatile unsigned int*)(0x4271E280UL))
#define bFM4_MFS15_UART_FCR_FE2                *((volatile unsigned int*)(0x4271E284UL))
#define bFM4_MFS15_UART_FCR_FCL1               *((volatile unsigned int*)(0x4271E288UL))
#define bFM4_MFS15_UART_FCR_FCL2               *((volatile unsigned int*)(0x4271E28CUL))
#define bFM4_MFS15_UART_FCR_FSET               *((volatile unsigned int*)(0x4271E290UL))
#define bFM4_MFS15_UART_FCR_FLD                *((volatile unsigned int*)(0x4271E294UL))
#define bFM4_MFS15_UART_FCR_FLST               *((volatile unsigned int*)(0x4271E298UL))
#define bFM4_MFS15_UART_FCR_FSEL               *((volatile unsigned int*)(0x4271E2A0UL))
#define bFM4_MFS15_UART_FCR_FTIE               *((volatile unsigned int*)(0x4271E2A4UL))
#define bFM4_MFS15_UART_FCR_FDRQ               *((volatile unsigned int*)(0x4271E2A8UL))
#define bFM4_MFS15_UART_FCR_FRIIE              *((volatile unsigned int*)(0x4271E2ACUL))
#define bFM4_MFS15_UART_FCR_FLSTE              *((volatile unsigned int*)(0x4271E2B0UL))
#define bFM4_MFS15_UART_FCR0_FE1               *((volatile unsigned int*)(0x4271E280UL))
#define bFM4_MFS15_UART_FCR0_FE2               *((volatile unsigned int*)(0x4271E284UL))
#define bFM4_MFS15_UART_FCR0_FCL1              *((volatile unsigned int*)(0x4271E288UL))
#define bFM4_MFS15_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4271E28CUL))
#define bFM4_MFS15_UART_FCR0_FSET              *((volatile unsigned int*)(0x4271E290UL))
#define bFM4_MFS15_UART_FCR0_FLD               *((volatile unsigned int*)(0x4271E294UL))
#define bFM4_MFS15_UART_FCR0_FLST              *((volatile unsigned int*)(0x4271E298UL))
#define bFM4_MFS15_UART_FCR1_FSEL              *((volatile unsigned int*)(0x4271E2A0UL))
#define bFM4_MFS15_UART_FCR1_FTIE              *((volatile unsigned int*)(0x4271E2A4UL))
#define bFM4_MFS15_UART_FCR1_FDRQ              *((volatile unsigned int*)(0x4271E2A8UL))
#define bFM4_MFS15_UART_FCR1_FRIIE             *((volatile unsigned int*)(0x4271E2ACUL))
#define bFM4_MFS15_UART_FCR1_FLSTE             *((volatile unsigned int*)(0x4271E2B0UL))
#define bFM4_MFS15_UART_FBYTE_FD0              *((volatile unsigned int*)(0x4271E300UL))
#define bFM4_MFS15_UART_FBYTE_FD1              *((volatile unsigned int*)(0x4271E304UL))
#define bFM4_MFS15_UART_FBYTE_FD2              *((volatile unsigned int*)(0x4271E308UL))
#define bFM4_MFS15_UART_FBYTE_FD3              *((volatile unsigned int*)(0x4271E30CUL))
#define bFM4_MFS15_UART_FBYTE_FD4              *((volatile unsigned int*)(0x4271E310UL))
#define bFM4_MFS15_UART_FBYTE_FD5              *((volatile unsigned int*)(0x4271E314UL))
#define bFM4_MFS15_UART_FBYTE_FD6              *((volatile unsigned int*)(0x4271E318UL))
#define bFM4_MFS15_UART_FBYTE_FD7              *((volatile unsigned int*)(0x4271E31CUL))
#define bFM4_MFS15_UART_FBYTE_FD8              *((volatile unsigned int*)(0x4271E320UL))
#define bFM4_MFS15_UART_FBYTE_FD9              *((volatile unsigned int*)(0x4271E324UL))
#define bFM4_MFS15_UART_FBYTE_FD10             *((volatile unsigned int*)(0x4271E328UL))
#define bFM4_MFS15_UART_FBYTE_FD11             *((volatile unsigned int*)(0x4271E32CUL))
#define bFM4_MFS15_UART_FBYTE_FD12             *((volatile unsigned int*)(0x4271E330UL))
#define bFM4_MFS15_UART_FBYTE_FD13             *((volatile unsigned int*)(0x4271E334UL))
#define bFM4_MFS15_UART_FBYTE_FD14             *((volatile unsigned int*)(0x4271E338UL))
#define bFM4_MFS15_UART_FBYTE_FD15             *((volatile unsigned int*)(0x4271E33CUL))
#define bFM4_MFS15_UART_FBYTE1_FD0             *((volatile unsigned int*)(0x4271E300UL))
#define bFM4_MFS15_UART_FBYTE1_FD1             *((volatile unsigned int*)(0x4271E304UL))
#define bFM4_MFS15_UART_FBYTE1_FD2             *((volatile unsigned int*)(0x4271E308UL))
#define bFM4_MFS15_UART_FBYTE1_FD3             *((volatile unsigned int*)(0x4271E30CUL))
#define bFM4_MFS15_UART_FBYTE1_FD4             *((volatile unsigned int*)(0x4271E310UL))
#define bFM4_MFS15_UART_FBYTE1_FD5             *((volatile unsigned int*)(0x4271E314UL))
#define bFM4_MFS15_UART_FBYTE1_FD6             *((volatile unsigned int*)(0x4271E318UL))
#define bFM4_MFS15_UART_FBYTE1_FD7             *((volatile unsigned int*)(0x4271E31CUL))
#define bFM4_MFS15_UART_FBYTE2_FD8             *((volatile unsigned int*)(0x4271E320UL))
#define bFM4_MFS15_UART_FBYTE2_FD9             *((volatile unsigned int*)(0x4271E324UL))
#define bFM4_MFS15_UART_FBYTE2_FD10            *((volatile unsigned int*)(0x4271E328UL))
#define bFM4_MFS15_UART_FBYTE2_FD11            *((volatile unsigned int*)(0x4271E32CUL))
#define bFM4_MFS15_UART_FBYTE2_FD12            *((volatile unsigned int*)(0x4271E330UL))
#define bFM4_MFS15_UART_FBYTE2_FD13            *((volatile unsigned int*)(0x4271E334UL))
#define bFM4_MFS15_UART_FBYTE2_FD14            *((volatile unsigned int*)(0x4271E338UL))
#define bFM4_MFS15_UART_FBYTE2_FD15            *((volatile unsigned int*)(0x4271E33CUL))

