snavien/EEC172/labs/Examples/TIMER/Timer/common/mb9abxxx.h
/* MFS LIN channel 15 registers */
#define bFM4_MFS15_LIN_SMR_SOE                 *((volatile unsigned int*)(0x4271E000UL))
#define bFM4_MFS15_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4271E00CUL))
#define bFM4_MFS15_LIN_SMR_WUCR                *((volatile unsigned int*)(0x4271E010UL))
#define bFM4_MFS15_LIN_SMR_MD0                 *((volatile unsigned int*)(0x4271E014UL))
#define bFM4_MFS15_LIN_SMR_MD1                 *((volatile unsigned int*)(0x4271E018UL))
#define bFM4_MFS15_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4271E01CUL))
#define bFM4_MFS15_LIN_SCR_TXE                 *((volatile unsigned int*)(0x4271E020UL))
#define bFM4_MFS15_LIN_SCR_RXE                 *((volatile unsigned int*)(0x4271E024UL))
#define bFM4_MFS15_LIN_SCR_TBIE                *((volatile unsigned int*)(0x4271E028UL))
#define bFM4_MFS15_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4271E02CUL))
#define bFM4_MFS15_LIN_SCR_RIE                 *((volatile unsigned int*)(0x4271E030UL))
#define bFM4_MFS15_LIN_SCR_LBR                 *((volatile unsigned int*)(0x4271E034UL))
#define bFM4_MFS15_LIN_SCR_MS                  *((volatile unsigned int*)(0x4271E038UL))
#define bFM4_MFS15_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4271E03CUL))
#define bFM4_MFS15_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x4271E080UL))
#define bFM4_MFS15_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x4271E084UL))
#define bFM4_MFS15_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x4271E088UL))
#define bFM4_MFS15_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4271E08CUL))
#define bFM4_MFS15_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x4271E090UL))
#define bFM4_MFS15_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x4271E098UL))
#define bFM4_MFS15_LIN_SSR_TBI                 *((volatile unsigned int*)(0x4271E0A0UL))
#define bFM4_MFS15_LIN_SSR_TDRE                *((volatile unsigned int*)(0x4271E0A4UL))
#define bFM4_MFS15_LIN_SSR_RDRF                *((volatile unsigned int*)(0x4271E0A8UL))
#define bFM4_MFS15_LIN_SSR_ORE                 *((volatile unsigned int*)(0x4271E0ACUL))
#define bFM4_MFS15_LIN_SSR_FRE                 *((volatile unsigned int*)(0x4271E0B0UL))
#define bFM4_MFS15_LIN_SSR_LBD                 *((volatile unsigned int*)(0x4271E0B4UL))
#define bFM4_MFS15_LIN_SSR_REC                 *((volatile unsigned int*)(0x4271E0BCUL))
#define bFM4_MFS15_LIN_BGR_EXT                 *((volatile unsigned int*)(0x4271E1BCUL))
#define bFM4_MFS15_LIN_BGR1_EXT                *((volatile unsigned int*)(0x4271E1BCUL))
#define bFM4_MFS15_LIN_FCR_FE1                 *((volatile unsigned int*)(0x4271E280UL))
#define bFM4_MFS15_LIN_FCR_FE2                 *((volatile unsigned int*)(0x4271E284UL))
#define bFM4_MFS15_LIN_FCR_FCL1                *((volatile unsigned int*)(0x4271E288UL))
#define bFM4_MFS15_LIN_FCR_FCL2                *((volatile unsigned int*)(0x4271E28CUL))
#define bFM4_MFS15_LIN_FCR_FSET                *((volatile unsigned int*)(0x4271E290UL))
#define bFM4_MFS15_LIN_FCR_FLD                 *((volatile unsigned int*)(0x4271E294UL))
#define bFM4_MFS15_LIN_FCR_FLST                *((volatile unsigned int*)(0x4271E298UL))
#define bFM4_MFS15_LIN_FCR_FSEL                *((volatile unsigned int*)(0x4271E2A0UL))
#define bFM4_MFS15_LIN_FCR_FTIE                *((volatile unsigned int*)(0x4271E2A4UL))
#define bFM4_MFS15_LIN_FCR_FDRQ                *((volatile unsigned int*)(0x4271E2A8UL))
#define bFM4_MFS15_LIN_FCR_FRIIE               *((volatile unsigned int*)(0x4271E2ACUL))
#define bFM4_MFS15_LIN_FCR_FLSTE               *((volatile unsigned int*)(0x4271E2B0UL))
#define bFM4_MFS15_LIN_FCR0_FE1                *((volatile unsigned int*)(0x4271E280UL))
#define bFM4_MFS15_LIN_FCR0_FE2                *((volatile unsigned int*)(0x4271E284UL))
#define bFM4_MFS15_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x4271E288UL))
#define bFM4_MFS15_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4271E28CUL))
#define bFM4_MFS15_LIN_FCR0_FSET               *((volatile unsigned int*)(0x4271E290UL))
#define bFM4_MFS15_LIN_FCR0_FLD                *((volatile unsigned int*)(0x4271E294UL))
#define bFM4_MFS15_LIN_FCR0_FLST               *((volatile unsigned int*)(0x4271E298UL))
#define bFM4_MFS15_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x4271E2A0UL))
#define bFM4_MFS15_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x4271E2A4UL))
#define bFM4_MFS15_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x4271E2A8UL))
#define bFM4_MFS15_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x4271E2ACUL))
#define bFM4_MFS15_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x4271E2B0UL))
#define bFM4_MFS15_LIN_FBYTE_FD0               *((volatile unsigned int*)(0x4271E300UL))
#define bFM4_MFS15_LIN_FBYTE_FD1               *((volatile unsigned int*)(0x4271E304UL))
#define bFM4_MFS15_LIN_FBYTE_FD2               *((volatile unsigned int*)(0x4271E308UL))
#define bFM4_MFS15_LIN_FBYTE_FD3               *((volatile unsigned int*)(0x4271E30CUL))
#define bFM4_MFS15_LIN_FBYTE_FD4               *((volatile unsigned int*)(0x4271E310UL))
#define bFM4_MFS15_LIN_FBYTE_FD5               *((volatile unsigned int*)(0x4271E314UL))
#define bFM4_MFS15_LIN_FBYTE_FD6               *((volatile unsigned int*)(0x4271E318UL))
#define bFM4_MFS15_LIN_FBYTE_FD7               *((volatile unsigned int*)(0x4271E31CUL))
#define bFM4_MFS15_LIN_FBYTE_FD8               *((volatile unsigned int*)(0x4271E320UL))
#define bFM4_MFS15_LIN_FBYTE_FD9               *((volatile unsigned int*)(0x4271E324UL))
#define bFM4_MFS15_LIN_FBYTE_FD10              *((volatile unsigned int*)(0x4271E328UL))
#define bFM4_MFS15_LIN_FBYTE_FD11              *((volatile unsigned int*)(0x4271E32CUL))
#define bFM4_MFS15_LIN_FBYTE_FD12              *((volatile unsigned int*)(0x4271E330UL))
#define bFM4_MFS15_LIN_FBYTE_FD13              *((volatile unsigned int*)(0x4271E334UL))
#define bFM4_MFS15_LIN_FBYTE_FD14              *((volatile unsigned int*)(0x4271E338UL))
#define bFM4_MFS15_LIN_FBYTE_FD15              *((volatile unsigned int*)(0x4271E33CUL))
#define bFM4_MFS15_LIN_FBYTE1_FD0              *((volatile unsigned int*)(0x4271E300UL))
#define bFM4_MFS15_LIN_FBYTE1_FD1              *((volatile unsigned int*)(0x4271E304UL))
#define bFM4_MFS15_LIN_FBYTE1_FD2              *((volatile unsigned int*)(0x4271E308UL))
#define bFM4_MFS15_LIN_FBYTE1_FD3              *((volatile unsigned int*)(0x4271E30CUL))
#define bFM4_MFS15_LIN_FBYTE1_FD4              *((volatile unsigned int*)(0x4271E310UL))
#define bFM4_MFS15_LIN_FBYTE1_FD5              *((volatile unsigned int*)(0x4271E314UL))
#define bFM4_MFS15_LIN_FBYTE1_FD6              *((volatile unsigned int*)(0x4271E318UL))
#define bFM4_MFS15_LIN_FBYTE1_FD7              *((volatile unsigned int*)(0x4271E31CUL))
#define bFM4_MFS15_LIN_FBYTE2_FD8              *((volatile unsigned int*)(0x4271E320UL))
#define bFM4_MFS15_LIN_FBYTE2_FD9              *((volatile unsigned int*)(0x4271E324UL))
#define bFM4_MFS15_LIN_FBYTE2_FD10             *((volatile unsigned int*)(0x4271E328UL))
#define bFM4_MFS15_LIN_FBYTE2_FD11             *((volatile unsigned int*)(0x4271E32CUL))
#define bFM4_MFS15_LIN_FBYTE2_FD12             *((volatile unsigned int*)(0x4271E330UL))
#define bFM4_MFS15_LIN_FBYTE2_FD13             *((volatile unsigned int*)(0x4271E334UL))
#define bFM4_MFS15_LIN_FBYTE2_FD14             *((volatile unsigned int*)(0x4271E338UL))
#define bFM4_MFS15_LIN_FBYTE2_FD15             *((volatile unsigned int*)(0x4271E33CUL))

